{
  "id": "edda3250-c63d-11f0-909a-8baa437a1f6c",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1763662973343313",
    "id": "628ed4ee7b967b11799146e8-pw7FzW_Jy9V52P1bv2pd6",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Columbus"
  },
  "messageCount": 16,
  "chatDuration": 696,
  "rating": 0,
  "createdOn": "2025-11-20T18:23:24.813Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-11-20T18:23:24.813Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:30:43.502Z",
      "msg": "Yes. Hello"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:30:46.875Z",
      "msg": "Hello! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:32:55.657Z",
      "msg": "Yes. My name is Gavin Turner and I'm a 42 year old Christian man. I'm really struggling so much right now and seek to be healed and delivered. I have struggled so badly with lust its like it won't let go. A bad pornography addiction and some heath issues doctors can't seem to fix. I'm so broken right now. Something drew me to this site, I prayers this lust deliverance prayer."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:33:01.022Z",
      "msg": "Hi Gavin! Thank you for sharing your struggles with me. It's great that you've reached out for support. We're here to offer guidance and prayer as you seek healing and deliverance. \n\nIf you'd like, I can share a powerful deliverance prayer that addresses lust and other struggles. Would you like me to do that?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:33:47.982Z",
      "msg": "Okay. I prayed through this prayer on the site. My email is gavinturner331@gmail.com."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:33:57.912Z",
      "msg": "Thank you for sharing your email, Gavin. It's wonderful that you've taken the step to pray through the deliverance prayer. \n\nIf you have any specific prayer requests or if there's anything else you'd like to discuss or need help with, please let me know. We're here to support you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:35:34.183Z",
      "msg": "I've been so discouraged lately. I've been in tears. Tired of struggling with heart and bp issues, mental health issues, insomnia. I once was very active and I'm so broken and feel so bound lately."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:35:43.436Z",
      "msg": "I'm really sorry to hear that you're feeling this way, Gavin. It sounds like you're going through a very difficult time, and it's completely understandable to feel discouraged. Remember, you're not alone in this battle, and we are here to support you.\n\nWould you like to share a specific prayer request? We can pray together for healing, strength, and peace during this challenging time."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:36:00.095Z",
      "msg": "Yes"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:36:05.794Z",
      "msg": "Please feel free to share your specific prayer request, and I'll be here to pray with you and for you."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:37:43.636Z",
      "msg": "I am sesking to be healed from these health issues of body and mind keeping me from serving like I'd like to and being able to live a normal and productive life like feel I once had. Feel the Pornography addiction has opened me up to some heavy demonic oppresion as well too."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:38:00.863Z",
      "msg": "Thank you for sharing your prayer request, Gavin. I will pray for your healing from the health issues affecting your body and mind, and for freedom from the pornography addiction and any demonic oppression you may be experiencing. \n\nHeavenly Father, we come before you today, lifting up Gavin. We ask for your healing touch upon his body and mind, restoring him to health and strength. We pray for freedom from the chains of addiction and any spiritual oppression that may be affecting him. Lord, fill him with your peace and strength, and guide him on his journey towards healing and wholeness. In Jesus' name, we pray. Amen.\n\nIf you have any other requests or need further support, please let me know. We're here for you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:39:40.797Z",
      "msg": "Thank you. Glad I found this site. Trying to keep the faith things will get better. Been a dark time here lately. God Bless you."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:39:49.513Z",
      "msg": "You're very welcome, Gavin! I'm glad you found us too. It's great to hear that you're trying to keep the faith, even during these dark times. Remember, there is always hope, and healing is possible. \n\nIf you ever need someone to talk to or more support, don't hesitate to reach out. God bless you, and may you find strength and peace in your journey ahead!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-11-20T18:42:08.684Z",
      "msg": "Thank you."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-11-20T18:42:19.089Z",
      "msg": "You're welcome, Gavin! If you need anything else or just want to chat, I'm here for you. Take care and stay strong!"
    }
  ],
  "domain": "fightlust.com"
}