{
  "id": "c2bf7910-8726-11ef-8921-337faf0af903",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Charlotte"
  },
  "messageCount": 3,
  "chatDuration": 1425,
  "rating": 0,
  "createdOn": "2024-10-10T16:43:53.672Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-10T16:43:53.672Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-10T16:51:29.213Z",
      "msg": "I pray for deliverance from the spirit of lust adultery harlotry pornography fornication sesuality and all impure thoughts these are strongholds that I need broken off my life I break all agreements with satan in regards to sexual sins I ask God to break all these agreements I have made with satan in regards to practicing sexual immorality I repent of these wicked agreements and actions and I seek purity in my mind body soul and eyes"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-10T16:52:25.560Z",
      "msg": "Pray this --- Dear Heavenly Father, I come before You in the name of Jesus, acknowledging my need for Your help and deliverance. I repent for allowing any foothold of sexual immorality, lust, and impure thoughts into my life. I ask for Your forgiveness for all agreements I have made with the enemy through my actions, thoughts, and desires. Lord, I break these agreements in the name of Jesus and renounce all strongholds of lust, adultery, fornication, pornography, and harlotry that have taken root in my life.\n\nFather, I ask that You purify my heart, mind, body, and soul. Cleanse my eyes and my thoughts from all impurity, and renew a right spirit within me. Let the blood of Jesus wash over me, covering my sins, and grant me the strength to resist temptation and walk in holiness. I ask for the Holy Spirit to fill me and guide me in righteousness. Set me free, Lord, from every chain of sexual immorality, and help me to live in the purity You have called me to.\n\nIn the mighty name of Jesus, I claim freedom, deliverance, and victory over all sexual sin. I place my trust in You, and I know that by Your power, I can overcome. Thank You for Your mercy and grace. Amen.\"\n\nStay committed to pursuing holiness, surrounding yourself with accountability, and immersing yourself in God's Word to guard your heart and mind. God is faithful to heal, strengthen, and restore you as you seek Him."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-10T17:07:38.851Z",
      "msg": "I renounce fornication sex before marriage I ask for forgiveness for opening that door to Satan creating a stronghold of rebellion and witchcraft to God's holy word I ask forgiveness and I repent of it I pray that fornication be banished by Jesus from my will and desires I renounce adultery and I loose myself from the spirit of adultery and I ask for the holy Spirit to help me to walk in obedience and to never seek sex or any sexual contact with anyone outside my marriage I pray for the spirit of Jesus to align with my spirit and remove all rebellion witchcraft agreements with satan and lust demons from my life I break all agreements with Satan in regards to harlotry I pray that God would help me to live a life that is pleasing in his sight I curse the spirit of lust harlotry adultery and fornication off of my life I surrender those sins to Jesus I release those sins and burdens to Jesus"
    }
  ],
  "domain": "fightlust.com"
}