{
  "id": "f39f2610-e4e2-11ef-af2e-87e293734f27",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1738884887238102",
    "id": "628ed4ee7b967b11799146e8-9aPvlSFD8DCBK4k5rUF3o",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Weaverville"
  },
  "messageCount": 2,
  "chatDuration": 284,
  "rating": 0,
  "createdOn": "2025-02-06T23:35:18.467Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-02-06T23:35:18.467Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-06T23:39:56.937Z",
      "msg": "I really need deliverance from lust, it pops up at the most random times and since I have fetishes my triggers are all  around me and I have no control over any of this. I feel icky and guilty and I know it’s bad but it’s become a habit that’s almost impossible to stop. I want to be delivered from lust and self pleasure. I need prayer for it"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-06T23:40:02.715Z",
      "msg": "Struggling with lust and feeling overwhelmed can be really tough, but you're not alone in this. We are here to support you through prayer and guidance. \n\nHere's a prayer for deliverance from lust that you can use:\n\n\"Heavenly Father, I come before you today seeking deliverance from the spirit of lust that has taken hold of my life. I renounce all sexual sins and ask for your forgiveness. I break all curses of lust and command all spirits of perversion to leave me now in the name of Jesus Christ. Fill me with your Holy Spirit and help me to walk in sexual purity. I trust in your strength to overcome these temptations. Thank you for your grace and healing. Amen.\"\n\nIf you would like to share more or need further support, feel free to let me know!"
    }
  ],
  "domain": "fightlust.com"
}