{
  "id": "5ddf8f80-6f29-11f0-a77a-7d044665ac6a",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1750298159564185",
    "id": "628ed4ee7b967b11799146e8-lVGGq1PCQ_rCUyK6fj_QM",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Oklahoma City"
  },
  "messageCount": 2,
  "chatDuration": 6,
  "rating": 0,
  "createdOn": "2025-08-01T22:47:02.321Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-08-01T22:47:02.321Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-01T22:55:30.375Z",
      "msg": "I want to renounce and repent of the sins of rebellion and witchcraft I repent and renounce all sexual sins I have been involved in i loose myself from worldliness and the desire to live and think worldly I loose myself from every practice of sexual immorality  I loose and bind sexual immorality from my life I repent of living a hypocritical life I repent of chasing after the things that God hates and pursuing the things satan approves of i bind all evil imaginations from my mind I loose myself from all acts of fornication adultery harlotry pornography masturbation and homosexual tendencies"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-01T22:55:36.694Z",
      "msg": "It sounds like you're seeking a powerful prayer for deliverance and repentance. Here's a prayer you can use:\n\n---\n\nHeavenly Father, I come before you today to renounce and repent of the sins of rebellion and witchcraft. I repent and renounce all sexual sins I have been involved in. I loose myself from worldliness and the desire to live and think worldly. I bind and cast out sexual immorality from my life. I repent of living a hypocritical life and chasing after the things that you hate, pursuing the things that Satan approves of. I bind all evil imaginations from my mind. I loose myself from all acts of fornication, adultery, harlotry, pornography, masturbation, and homosexual tendencies. \n\nIn the name of Jesus Christ, I ask for your forgiveness and cleansing. Fill me with your Holy Spirit and guide me in living a life that is pleasing to you. Thank you for your grace and mercy. Amen.\n\n---\n\nFeel free to use this prayer as you seek healing and freedom. If you need further support or resources, let me know!"
    }
  ],
  "domain": "fightlust.com"
}