{
  "id": "cd822200-4cb3-11f0-9416-dde576a4a6c8",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1750060017888621",
    "id": "628ed4ee7b967b11799146e8-vqQAzZvKUc05P7QCYdP0Y",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Jacksonville"
  },
  "messageCount": 14,
  "chatDuration": 385,
  "rating": 0,
  "createdOn": "2025-06-19T02:19:49.031Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-06-19T02:19:49.031Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:20:56.061Z",
      "msg": "Hello"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:21:00.947Z",
      "msg": "Welcome to FightLust.com! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:22:26.339Z",
      "msg": "Please pray for me... I have been battling fornication and lust for over a decade and everytime I try to please God... I end up failing ... Im tired of being disobedient and rebelious"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:22:31.234Z",
      "msg": "I'm here for you, and I want to support you in this struggle. Let's pray together:\n\nHeavenly Father, we come before you today, seeking your strength and guidance. We ask for your forgiveness for the struggles with fornication and lust. Please help this individual to find freedom in Christ and to overcome these challenges. Fill them with your Holy Spirit and guide them towards a path of purity and obedience. We trust in your love and grace to heal and restore. In Jesus' name, we pray. Amen.\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:24:33.503Z",
      "msg": "Thank you! I need mentorship"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:24:40.451Z",
      "msg": "It's great to hear that you're seeking mentorship! We can help guide you to resources and support groups that can provide the mentorship you need. Would you like information on how to connect with a support group or a mentor?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:24:53.991Z",
      "msg": "Yes please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:25:00.194Z",
      "msg": "You might find the Samson Society helpful, as they provide a safe space for men to share their struggles and support one another. They focus on transparency and accountability in a judgment-free environment. \n\nIf you're interested, I can help you find more information on how to get involved with them. Would you like that?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:25:24.910Z",
      "msg": "I am a woman"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:25:33.199Z",
      "msg": "Thank you for sharing that! We can help connect you with resources and support groups specifically for women. Would you like information on women's support groups or mentorship programs?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:25:43.055Z",
      "msg": "Yes please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:25:52.659Z",
      "msg": "I currently don't have specific information on women's support groups or mentorship programs. However, I recommend reaching out to local churches or ministries that focus on women's issues, as they often have resources and support available. \n\nIf you have any other questions or need further assistance, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-19T02:26:07.671Z",
      "msg": "Thank you"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-19T02:26:13.914Z",
      "msg": "You're welcome! If you need anything else or have more questions in the future, don't hesitate to reach out. We're here to support you. Take care!"
    }
  ],
  "domain": "fightlust.com"
}