{
  "id": "181d88c0-d7d5-11f0-9158-7f761623fc46",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1765576128019789",
    "id": "628ed4ee7b967b11799146e8-smyyGEcCwrrASMAK32bYz",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Myrtle Beach"
  },
  "messageCount": 8,
  "chatDuration": 204,
  "rating": 0,
  "createdOn": "2025-12-13T03:38:18.420Z",
  "messages": [
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-12-13T03:38:18.420Z",
      "msg": "I mess up today looking at stuff"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-12-13T03:38:22.171Z",
      "msg": "I'm sorry to hear that you're feeling this way. It's important to remember that setbacks can happen, but you're not alone in this journey. We're here to offer encouragement and support. Would you like to share more about how you're feeling or perhaps a prayer request?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-12-13T03:39:19.542Z",
      "msg": "I am tired of messing up looking at crap on the internet. Need prayer again lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-12-13T03:39:24.500Z",
      "msg": "I understand how challenging this can be, and I'm here to support you. Let's pray together:\n\n\"Heavenly Father, we come before you today, seeking your strength and guidance. We renounce the spirit of lust and all sexual sins that have been a struggle. We ask for your cleansing and healing in our hearts and minds. Help us to overcome these temptations and fill us with your Holy Spirit to walk in purity. We trust in your power to break the chains of addiction and to lead us towards freedom in Christ. In Jesus' name, we pray. Amen.\"\n\nIf you need more specific prayers or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-12-13T03:40:45.815Z",
      "msg": "Thank you That' it just. angry that I messed cause I know better"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-12-13T03:40:53.835Z",
      "msg": "It's completely understandable to feel angry and frustrated with yourself, especially when you know what you want to avoid. Remember, it's part of the journey, and it's okay to have these feelings. What's important is that you're seeking support and wanting to move forward. \n\nIf you need to talk more about it or want guidance on how to stay strong in your faith, I'm here to help! You're not alone in this."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-12-13T03:41:37.667Z",
      "msg": "Thank you so much"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-12-13T03:41:42.822Z",
      "msg": "You're very welcome! If you need anything else or just want to talk, feel free to reach out. Remember, we're here to support you on your journey. Take care!"
    }
  ],
  "domain": "fightlust.com"
}