{
  "id": "7170d8e0-b1c5-11f0-a5ff-f949be30e8c8",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1761323273324401",
    "id": "628ed4ee7b967b11799146e8-Mf1W2M9WPobijdxB4ZUyq",
    "email": null
  },
  "location": {
    "countryCode": "MW",
    "city": "Unknown"
  },
  "messageCount": 4,
  "chatDuration": 65,
  "rating": 0,
  "createdOn": "2025-10-25T17:10:34.191Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-10-25T17:10:34.191Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T17:17:25.450Z",
      "msg": "I need deliverance prayers for me and someone"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T17:17:31.986Z",
      "msg": "We have powerful deliverance prayers available that can help you and the person you're concerned about. Here’s a prayer you can use:\n\n---\n\n**Heavenly Father,**  \nWe come before your throne room today through the blood of Jesus Christ. We come boldly and with confidence. For your Word says that when we confess our sins, you are faithful and forgive our sins and cleanse us from all unrighteousness. Today, we are praying against the Spirit of lust, lust within our hearts, minds, and bodies. We renounce all sexual sins that we have been involved in the past, including fornication, masturbation, pornography, and perversion, in the name of Jesus Christ. \n\nWe break all curses of lust and command all spirits of perversion to come out of our lives right now! We present our bodies to the Lord as a living sacrifice. Fill us with the power of your Holy Spirit and help us walk in sexual purity. \n\n---\n\nYou can find more detailed prayers and resources on our site. If you need further assistance or specific prayers, let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T17:18:24.644Z",
      "msg": "I need specific prayers for someone"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T17:18:30.763Z",
      "msg": "Please wait while we connect you. If you’re unable to reach someone, feel free to email us at prayer@fightlust.com."
    }
  ],
  "domain": "fightlust.com"
}