{
  "id": "f19e6320-b1ed-11f0-94e3-a128b5e99637",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1761429596704996",
    "id": "628ed4ee7b967b11799146e8-BynyTPWq9o6prV7rSzWjQ",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 10,
  "chatDuration": 284,
  "rating": 0,
  "createdOn": "2025-10-25T22:00:27.725Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-10-25T22:00:27.725Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T22:16:34.938Z",
      "msg": "I am in need of deliverance"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T22:16:38.445Z",
      "msg": "I'm here to support you in your journey towards healing. We have powerful resources and prayers available to help with deliverance. Would you like me to share a specific deliverance prayer with you?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T22:16:57.756Z",
      "msg": "Yes, please."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T22:17:12.429Z",
      "msg": "Here’s a powerful deliverance prayer you can use:\n\n---\n\n**Heavenly Father,**\n\nWe come before your throne room today through the blood of Jesus Christ. We come boldly and with confidence. For your Word says that when we confess our sins, you are faithful and forgive our sins and cleanse us from all unrighteousness. \n\nToday, we are praying against the Spirit of lust, lust within our hearts, minds, and bodies. We renounce all sexual sins that we have been involved in the past, including fornication, masturbation, pornography, perversion, fantasy, and adultery, in the name of Jesus Christ. \n\nWe break all curses of adultery, perversion, fornication, lust, incest, rape, molestation, harlotry, and polygamy in the name of Jesus Christ. We command all spirits of lust and perversion to come out of our lives right now! \n\nWe present our bodies to the Lord as a living sacrifice. We receive the Spirit of holiness in our lives now to walk in sexual purity. Lord, we loosen ourselves from the Spirit of this world, the Spirit of the flesh, the lust of the eyes, and the pride. \n\nWe thank You for Your Word and how it is established in our hearts and lives. We praise You and give You all the glory right now! In the name of Jesus Christ, we thank You, Lord, for filling us with the power of Your Holy Spirit.\n\n---\n\nFeel free to pray this prayer earnestly, and remember that you are not alone in this journey. If you need further support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T22:17:31.269Z",
      "msg": "Thank you kindly 🙏"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T22:17:35.859Z",
      "msg": "You're very welcome! If you have any more questions or need further support, feel free to reach out. We're here for you. God bless you! 🙏"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T22:20:44.488Z",
      "msg": "Can you send me a prayer reto rebuke the sprit of confusion, set back, and delays?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T22:20:58.186Z",
      "msg": "I don't have a specific prayer for rebuking the spirit of confusion, setbacks, and delays in the provided information. However, I can guide you on how to pray about these issues.\n\nYou can start by addressing God directly, acknowledging your feelings of confusion and frustration, and asking for clarity, strength, and guidance. Here’s a general outline you can follow:\n\n---\n\n**Heavenly Father,**\n\nI come before You today seeking Your wisdom and clarity. I feel confused and overwhelmed by setbacks and delays in my life. I ask that You rebuke any spirit of confusion that is trying to cloud my mind and lead me astray.\n\nPlease grant me the strength to overcome these challenges and the patience to wait for Your perfect timing. Help me to trust in Your plan for my life and to find peace in the midst of uncertainty.\n\nIn the name of Jesus, I declare that confusion, setbacks, and delays have no power over me. I claim victory over these obstacles and ask for Your guidance to move forward with confidence.\n\nThank You for hearing my prayer. I trust in Your unfailing love and support.\n\nAmen.\n\n---\n\nFeel free to modify this prayer to fit your personal feelings and situation. If you need more assistance, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-10-25T22:21:11.595Z",
      "msg": "Thank you."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-10-25T22:21:18.653Z",
      "msg": "You're welcome! If you have any more questions or need further support, feel free to reach out. I'm here to help. God bless you!"
    }
  ],
  "domain": "fightlust.com"
}