{
  "id": "73f59b20-84ce-11ef-83fc-6d5741d4eb16",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Charlotte"
  },
  "messageCount": 12,
  "chatDuration": 2137,
  "rating": 0,
  "createdOn": "2024-10-07T17:06:43.601Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-07T17:06:43.601Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:12:36.545Z",
      "msg": "I want to be released from the spirit of adultery harlotry fornication pornography masturbation homosexuality and lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:12:46.056Z",
      "msg": "We're here to support you in your journey towards healing. You can pray for release from these spirits by renouncing them in the name of Jesus Christ. Here's a prayer you can use:\n\n\"Heavenly Father, I come before you today and renounce all sexual sins, including adultery, harlotry, fornication, pornography, masturbation, homosexuality, and lust. In the name of Jesus Christ, I break all curses associated with these sins and command all spirits of lust and perversion to come out of my life. I ask for your strength and the Spirit of holiness to fill me as I seek to walk in purity.\"\n\nIf you need further guidance or support, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:17:08.429Z",
      "msg": "I want to be free from the spirit of hypocrisy idolatry self righteousness lying and I repent of breaking the 10 commandments I want the grace from on high to help me to walk in the 10 commandments and obey the 10 commandments"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:17:15.348Z",
      "msg": "It's wonderful that you're seeking freedom and repentance. You can pray for release from these spirits and ask for God's grace to help you walk in obedience to His commandments. Here's a prayer you might find helpful:\n\n\"Dear Lord, I come to you with a humble heart, repenting of hypocrisy, idolatry, self-righteousness, and lying. I acknowledge that I have broken your commandments, and I ask for your forgiveness. Please cleanse me from all unrighteousness and fill me with your grace from on high. Help me to walk in your ways and to obey your commandments with a sincere heart. Thank you for your mercy and love.\"\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:24:36.232Z",
      "msg": "I want my sexuality cleansed by the blood of Jesus I want to be free of all sexual sin and I break all agreements that I have made with satan in regards to sexual sin and my sexual integrity I pray that the agreements that I made with satan to be loosed from me and loosed from my sexual identity I break and I ask God to loose me of the blinding effects of sexual sin I place my sexual identity and my sexuality at the foot of the cross I repent and ask God to sever every sexual contact I have had with anyone outside my marriage I ask for him to release me from the stronghold of lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:24:45.642Z",
      "msg": "Welcome! It’s great to see you reaching out for support in your journey towards healing. \n\nI encourage you to pray with sincerity and faith. Here’s a prayer you can use to help you in this process:\n\n\"Heavenly Father, I come before you today through the blood of Jesus Christ. I renounce all sexual sins and agreements I have made with Satan regarding my sexual integrity. I ask you to loose me from the blinding effects of sexual sin and to sever every sexual contact I have had outside of my marriage. I place my sexual identity at the foot of the cross and ask for your healing and restoration. Fill me with the power of your Holy Spirit and help me walk in sexual purity. In the name of Jesus Christ, I break all strongholds of lust and declare my freedom. Amen.\"\n\nIf you need further guidance or support, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:30:30.054Z",
      "msg": "I sever all ties of sexual immorality and I invite God into my life and my sexual identity I ask to be washed in the blood of the lamb to free me from all sin especially sexual sin I repent for practicing lawlessness I ask to be released from worldliness and I confess that I need Jesus in my life to be released from the sins that bind me to satan agenda I renounce satan agenda"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:30:40.629Z",
      "msg": "It's wonderful to see your commitment to seeking freedom and inviting God into your life. Here’s a prayer you can use to express your heart's desire:\n\n\"Heavenly Father, I sever all ties of sexual immorality and invite you into my life and my sexual identity. I ask to be washed in the blood of the Lamb to free me from all sin, especially sexual sin. I repent for practicing lawlessness and ask to be released from worldliness. I confess that I need Jesus in my life to be released from the sins that bind me to Satan's agenda. I renounce Satan's agenda and declare my desire for your will to be done in my life. Fill me with your Holy Spirit and guide me in the path of righteousness. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:33:43.211Z",
      "msg": "I pray for pure thoughts from on high to take control of my life will feelings and emotions I release Satan from every part of my being and I declare that I was created to honor God and I release myself from everything that dishonors God"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:33:55.382Z",
      "msg": "That's a powerful declaration! Here’s a prayer you can use to express your desire for purity and release from anything that dishonors God:\n\n\"Heavenly Father, I pray for pure thoughts from on high to take control of my life, my feelings, and my emotions. I release Satan from every part of my being and declare that I was created to honor You. I release myself from everything that dishonors You, Lord. Fill me with Your Spirit and guide me in Your ways. Help me to walk in purity and righteousness, reflecting Your love and grace in my life. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need further assistance or guidance, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-07T17:42:12.212Z",
      "msg": "I release myself from the spirit of compromise and rebellion I submit myself to the will of God I ask God to deliver me the lies of Satan and I release myself from the blind folds that Satan has had on my soul and my sexuality I release myself and my existence into the hands of my creator"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-07T17:42:20.508Z",
      "msg": "That's a beautiful and heartfelt prayer! Here’s a prayer you can use to express your commitment to God and seek deliverance:\n\n\"Heavenly Father, I release myself from the spirit of compromise and rebellion. I submit myself to Your will and ask for Your deliverance from the lies of Satan. I release myself from the blindfolds that Satan has placed on my soul and my sexuality. I surrender my existence into Your hands, my Creator. Fill me with Your truth and guide me in Your ways. Help me to walk in the light of Your love and grace. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need more support or resources, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}