{
  "id": "58259e80-1723-11f0-85c6-c3d2d60d7280",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1744410101815517",
    "id": "628ed4ee7b967b11799146e8-2jutUruPOMpVMAtwA_NSf",
    "email": null
  },
  "location": {
    "countryCode": "NG",
    "city": "Unknown"
  },
  "messageCount": 16,
  "chatDuration": 1023,
  "rating": 0,
  "createdOn": "2025-04-11T22:22:15.187Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-04-11T22:22:15.187Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:31:59.129Z",
      "msg": "Hello"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:32:02.583Z",
      "msg": "Hello! Welcome to FightLust.com! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:32:22.977Z",
      "msg": "I don't know how you can support me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:32:26.989Z",
      "msg": "That's okay! Struggling with pornography or sexual addiction can be tough. We're here to offer guidance and prayer. How can we assist you? Would you like to share what you're feeling or any specific challenges you're facing?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:33:01.263Z",
      "msg": "I want to break free from any form of lust or pornography! I want to break free"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:33:08.063Z",
      "msg": "It's great that you're seeking freedom! We can help you with prayers and resources to support your journey. Would you like to start with a prayer for strength and guidance?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:33:12.127Z",
      "msg": "I am tired!"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:33:18.195Z",
      "msg": "I understand that feeling tired can be overwhelming. It's important to know that you're not alone in this struggle. We can offer you encouragement and support. Would you like to share a prayer request? We're here to pray with you and for you."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:34:22.509Z",
      "msg": "Please I want God and the Holy Spirit to help me overcome lust! Kill the lust in my eyes, pride!!"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:34:33.817Z",
      "msg": "Thank you for sharing your prayer request. Let's pray together:\n\nHeavenly Father, we come before you today, asking for your help and strength. We pray for the individual seeking freedom from lust and pride. Lord, please cleanse their eyes and hearts, and fill them with the Holy Spirit to overcome these struggles. We ask that you break any strongholds and grant them the strength to walk in purity and righteousness. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:35:51.578Z",
      "msg": "Yes, please share any Bible verses that could help me in my struggle and if you have any resources you seem necessary for me, please share with me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:36:01.138Z",
      "msg": "Here are some Bible verses that can help you in your struggle:\n\n1. **John 8:32** - \"And you shall know the truth, and the truth shall make you free.\"\n2. **1 Corinthians 10:13** - \"No temptation has overtaken you except such as is common to man; but God is faithful, who will not allow you to be tempted beyond what you are able.\"\n3. **Romans 6:12** - \"Therefore do not let sin reign in your mortal body, that you should obey it in its lusts.\"\n4. **Galatians 5:16** - \"I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh.\"\n5. **1 Peter 2:11** - \"Beloved, I beg you as sojourners and pilgrims, abstain from fleshly lusts which war against the soul.\"\n\nFor additional resources, you can explore our site for prayers and guidance on overcoming lust and maintaining purity. If you need specific resources or prayers, let me know, and I'll help you find what you need!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:37:36.160Z",
      "msg": "Thank you. I want more prayers!!"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:37:44.739Z",
      "msg": "Absolutely! Here’s a powerful prayer you can use to seek freedom from lust:\n\n---\n\n**Heavenly Father,**\n\nI come before you today, acknowledging my struggles with lust and the temptations that surround me. I ask for your forgiveness for any sins I have committed and for the strength to overcome these challenges. \n\nLord, I pray that you cleanse my heart and mind. Help me to turn away from anything that leads me into temptation. Fill me with your Holy Spirit, and guide me to walk in purity and righteousness. \n\nI renounce all forms of lust and pride in my life. Break any strongholds that the enemy has placed upon me. I claim victory over these struggles in the name of Jesus Christ. \n\nThank you for your love, grace, and the freedom that comes through you. I trust in your power to help me overcome. \n\nIn Jesus' name, I pray. Amen.\n\n---\n\nIf you would like more specific prayers or guidance, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-11T22:39:06.166Z",
      "msg": "Thank you"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-11T22:39:18.459Z",
      "msg": "You're welcome! If you need anything else or have more questions, feel free to ask. I'm here to support you on your journey!"
    }
  ],
  "domain": "fightlust.com"
}