{
  "id": "984c4de0-25f8-11f0-b0c1-4f44c2c88976",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1745962372384446",
    "id": "628ed4ee7b967b11799146e8-iYp8tsbicjejm5lwnj6ak",
    "email": null
  },
  "location": {
    "countryCode": "ZA",
    "city": "Cape Town"
  },
  "messageCount": 6,
  "chatDuration": 388,
  "rating": 0,
  "createdOn": "2025-04-30T19:24:01.634Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-04-30T19:24:01.634Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-30T19:26:21.198Z",
      "msg": "Please pray for my marriage. My husband is having an affair and moved out. We have two beautiful boys. A 5 year old and a 6 month old baby. Please help in prayer to bring him back home and open his eyes for the goodness of his family. He pushes even his kids away due to the affair. I pray against this curse and I pray against soul ties. Soften his heart of stone and turn it into heart of flesh. I forgive then and pray that he sees the good in the family he has created and to leave the third person in our marriage immediately."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-30T19:26:27.830Z",
      "msg": "Thank you for sharing your prayer request. We are here to pray with you and for you. \n\nHeavenly Father, we come before you today, lifting up this marriage in need of healing. We ask that you soften the heart of the husband, turning it from stone to flesh, and open his eyes to the love and goodness of his family. We pray against any soul ties that may be affecting him and ask for your divine intervention to bring him back home to his wife and children. \n\nLord, we ask for strength and peace for the wife as she navigates this difficult time. May she feel your presence and comfort, knowing that you are working in their lives. We trust in your power to restore and heal this family. In Jesus' name, we pray. Amen.\n\nIf you need further support or resources, feel free to ask. We're here for you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-30T19:28:43.246Z",
      "msg": "I just wish my husband won't make such impulsive decisions by sleeping around. I want him to make more time for his children and come back to his wife, me. I pray that the Good Lord will work over night so Joy can come in the morning. We will work through this with God at the centre of our marriage and family."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-30T19:28:49.821Z",
      "msg": "It's understandable to feel this way, and your desire for healing and restoration is powerful. Let's continue to pray together.\n\nHeavenly Father, we lift up this marriage once again. We ask that you guide the husband to make wise decisions and prioritize his family. May he recognize the importance of his role as a father and husband, and may he feel the love and support of his wife and children. \n\nLord, we pray for a transformation in his heart, that he may turn away from impulsive actions and seek the joy and fulfillment that comes from being with his family. We trust that you can bring about change overnight, and we hold onto the hope that joy will come in the morning.\n\nMay this family work through their challenges with you at the center, finding strength and unity in your love. In Jesus' name, we pray. Amen.\n\nIf there's anything else you'd like to share or if you need more support, I'm here for you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-04-30T19:30:17.359Z",
      "msg": "Thank you. I believe that God is at work right now. My husband's blindness is fading and he's is retuning home tomorrow"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-04-30T19:30:29.480Z",
      "msg": "That's wonderful news! I'm so glad to hear that your husband is returning home. Let's continue to pray for a smooth transition and for healing in your marriage.\n\nHeavenly Father, we thank you for the progress and for bringing this husband back home. We ask that you continue to work in their hearts, fostering love, understanding, and forgiveness. May this family grow stronger together, with you at the center of their lives. \n\nWe trust in your goodness and grace, and we celebrate this step towards healing. In Jesus' name, we pray. Amen.\n\nIf you need anything else or want to share more updates, feel free to reach out!"
    }
  ],
  "domain": "fightlust.com"
}