{
  "id": "49954590-51b3-11ef-8f90-b59e6099f081",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1722701594694384",
    "id": "628ed4ee7b967b11799146e8-jSz9EBrXBWcAUxfcJcKH2",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Tarpon Springs"
  },
  "messageCount": 10,
  "chatDuration": 300,
  "rating": 0,
  "createdOn": "2024-08-03T16:13:45.761Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-03T16:13:45.761Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-03T16:15:47.024Z",
      "msg": "Hello I have had addiction to pornography since I was 13 years old. I’m 30 now and despite numerous attempts to quit and number out deliverance attempts I still come up short. Feeling discouraged and disappointed. I know God is real and I know Jesus Christ died for my sins but I still can’t stop myself at time it seems"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-03T16:15:53.798Z",
      "msg": "I'm really sorry to hear that you're feeling this way. It's important to know that you're not alone in this struggle. Many people face similar challenges, and it's okay to feel discouraged. \n\nRemember, the root issue often lies in not being satisfied in Christ. Focusing on Him rather than just the desire to be free from pornography can lead to true freedom. As you seek Him, you may find the strength and satisfaction you need to overcome these temptations. \n\nIf you'd like, I can help guide you to some resources or prayers that may support you in your journey. How can we assist you further?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-03T16:16:52.852Z",
      "msg": "Resources and prayers would be appreciated"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-03T16:16:55.873Z",
      "msg": "Absolutely! We have various resources and prayers available to support you in your journey towards healing. \n\nFor prayers, you can start with asking God for strength and guidance in your struggle. Here’s a simple prayer you can use:\n\n\"Dear Lord, I come to you feeling weak and discouraged. Please grant me the strength to overcome my struggles with pornography. Help me to find my satisfaction in You and to seek Your guidance in every moment of temptation. Amen.\"\n\nAs for resources, we offer community support and biblical guidance that can help you on your path to healing. If you're interested in joining a support group or learning more about specific materials, please let me know, and I can provide more information!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-03T16:17:35.401Z",
      "msg": "I’ll take some more information please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-03T16:17:40.918Z",
      "msg": "Great! Joining a support group can be a powerful way to connect with others who understand what you're going through. It provides a safe space to share experiences and receive encouragement.\n\nIf you're interested, I can help you find information on how to connect with a support group through our ministry. Additionally, we have resources that include biblical insights and practical tips for maintaining purity and overcoming addiction.\n\nPlease let me know what specific information you're looking for, and I'll do my best to assist you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-03T16:18:03.340Z",
      "msg": "Support group"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-03T16:18:08.941Z",
      "msg": "We have a wonderful community called the Samson Society, which is dedicated to supporting men in their journey towards sexual sanity and authentic relationships. They provide a space where men can be transparent without judgment or shame.\n\nTo get involved, you can find a local group or connect with others online. There are no fees for membership, and it's a great way to share your experiences and receive support from others who are on a similar path.\n\nIf you'd like, I can guide you on how to find a group near you or provide more details about their meetings. Just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-03T16:18:37.702Z",
      "msg": "Yes please I want to get involved"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-03T16:18:46.075Z",
      "msg": "That's wonderful to hear! To get involved with the Samson Society, you can visit their website at [samsonsociety.org](https://samsonsociety.org). There, you can find information about local groups, online meetings, and how to connect with other men who are on a similar journey.\n\nJoining a group can provide you with the support and encouragement you need. If you have any questions or need further assistance, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}