{
  "id": "9c4cda90-52c6-11f0-87f3-091db9c33a36",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1750967342707961",
    "id": "628ed4ee7b967b11799146e8-ccALaIi5B97xT0gwvQXDF",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Sacramento"
  },
  "messageCount": 8,
  "chatDuration": 148,
  "rating": 0,
  "createdOn": "2025-06-26T19:49:37.201Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-06-26T19:49:37.201Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-26T19:57:21.820Z",
      "msg": "Hello"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-26T19:57:24.803Z",
      "msg": "Hello! Welcome to FightLust.com! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-26T19:58:28.028Z",
      "msg": "I just said the prayer on the page. I have struggled with pantyhose foot fetishes, and the need to be degraded by women as well as men. Cross-dressing and transgender ism. I added stuff to the prayer to acknowledge this stuff and be delivered from it. Do you think that was enough?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-26T19:58:34.430Z",
      "msg": "It's great to hear that you've taken the step to pray and seek deliverance. Acknowledging your struggles in prayer is an important part of the healing process. If you feel led to continue seeking support, we can help guide you to additional resources or prayers that may assist you further. Remember, healing is a journey, and it's okay to seek help along the way. How else can I assist you today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-26T19:58:59.370Z",
      "msg": "Is there any other prayers you would recommend?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-26T19:59:08.880Z",
      "msg": "Absolutely! Here are some types of prayers you might find helpful:\n\n1. **Confession Prayers**: Acknowledge your struggles and ask for God's forgiveness and cleansing. You can use scriptures like Psalm 51:10-13 and 1 John 1:9.\n\n2. **Supplication Prayers**: Ask God for His divine help to meet your needs and overcome your struggles. Philippians 4:6-7 is a great reference for this.\n\n3. **Thanksgiving Prayers**: Thank God for His love, grace, and the blessings in your life. 1 Thessalonians 5:16-18 encourages us to give thanks in all circumstances.\n\n4. **A.C.T.S. Prayer Model**: This model includes Adoration, Confession, Thanksgiving, and Supplication, which can help structure your prayers.\n\nIf you would like more specific prayers or guidance on any of these, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-06-26T19:59:42.932Z",
      "msg": "Thanks"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-06-26T19:59:50.049Z",
      "msg": "You're welcome! If you have any more questions or need further support, feel free to ask. We're here to help you on your journey!"
    }
  ],
  "domain": "fightlust.com"
}