{
  "id": "4ff57d70-6675-11ef-a40e-1713159d225f",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 8,
  "chatDuration": 692,
  "rating": 0,
  "createdOn": "2024-08-30T02:13:02.295Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-30T02:13:02.295Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T02:21:57.874Z",
      "msg": "I want to be able to distinguish when God is talking to me versus when I'm hearing myself  my marriage is supposed to be my first ministry I repent and I ask God to forgive me for how I have dealt with the wife of my youth I ask him help me to make things right with her and I repent of my disobedience in this matter I ask for restoration and the ability to be obedient to his word"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T02:22:01.534Z",
      "msg": "Thank you for sharing your heart. It's wonderful that you're seeking restoration and obedience in your marriage. Would you like to share a specific prayer request? We're here to pray with you and for you."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T02:22:26.633Z",
      "msg": "I appreciate the prayer"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T02:22:29.813Z",
      "msg": "You're very welcome! If you have any specific prayer requests or need further support, feel free to let me know. We're here to help you on your journey towards healing and restoration."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T02:22:55.601Z",
      "msg": "I request prayer"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T02:23:00.054Z",
      "msg": "Absolutely! I will pray for you. \n\nHeavenly Father, we lift up this individual to You. We ask for Your guidance and clarity in distinguishing Your voice from their own thoughts. We pray for restoration in their marriage and for the strength to be obedient to Your word. Please grant them wisdom and the ability to make things right with their spouse. In Jesus' name, we pray. Amen.\n\nIf there's anything more specific you'd like to include in your prayer, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T02:24:28.338Z",
      "msg": "I want to soften my heart and I want to be his craftsmanship"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T02:24:33.928Z",
      "msg": "That's a beautiful desire! I will include that in our prayer. \n\nHeavenly Father, we come before You, asking for a softened heart for this individual. We pray that You mold them into Your craftsmanship, shaping them according to Your will and purpose. Help them to be open to Your guidance and to grow in their relationship with You. In Jesus' name, we pray. Amen.\n\nIf there's anything else you'd like to add or if you need further support, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}