{
  "id": "c7cefaf0-6667-11ef-81df-69056e59b9b1",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 20,
  "chatDuration": 1780,
  "rating": 0,
  "createdOn": "2024-08-30T00:36:10.474Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-30T00:36:10.474Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:39:26.882Z",
      "msg": "I want to repent of all sexual sin and I renounce all sexual sin that I have been involved in I want to soften my heart to the things of God I want to renounce every way I have allowed Satan to use me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:39:31.254Z",
      "msg": "It's great to hear that you're seeking to repent and soften your heart towards God. You can pray along these lines:\n\n\"Heavenly Father, I come before you today to repent of all sexual sins I have been involved in. I renounce every way I have allowed Satan to use me. I ask for your forgiveness and for the cleansing of my heart. Help me to walk in purity and righteousness, and fill me with your Holy Spirit to guide me in my journey towards healing.\"\n\nIf you need further support or specific prayers, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:42:36.331Z",
      "msg": "I want to redidicate my self to pure living and I want to repent cause I feel I have trampled the things of God and I don't think I have committed the unpardonable sin"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:42:42.514Z",
      "msg": "It's wonderful that you want to rededicate yourself to pure living and seek repentance. You can express your heart to God with a prayer like this:\n\n\"Lord, I come to you with a humble heart, seeking to rededicate myself to pure living. I repent for any ways I have trampled on the things of God. I trust in your mercy and grace, knowing that I have not committed the unpardonable sin. Please cleanse my heart and guide me in my journey towards holiness.\"\n\nIf you need more guidance or support, I'm here to help!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:45:35.997Z",
      "msg": "I don't want to speak on my own behalf anymore but I want to allow God to open order my tongue and my life so I'm in his will and not in my own will or the enemy will"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:45:41.014Z",
      "msg": "It's a beautiful desire to surrender your will to God and allow Him to guide your life. You can pray something like this:\n\n\"Dear God, I surrender my tongue and my life to you. I ask that you open my mouth to speak your words and guide my actions according to your will. Help me to align my desires with yours and to resist the enemy's influence in my life. I trust in your perfect plan for me.\"\n\nIf you need further support or specific prayers, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:47:13.168Z",
      "msg": "Anything that I have spoken on my own accord I repent of and all sexual sins I repent of"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:47:20.175Z",
      "msg": "It's wonderful that you're seeking repentance. You can pray a prayer of repentance like this:\n\n\"Heavenly Father, I come before you with a humble heart. I repent for anything I have spoken on my own accord that does not align with your will. I also repent of all sexual sins I have committed. Please cleanse me and renew my spirit. I ask for your forgiveness and guidance as I strive to live a life that honors you.\"\n\nIf you would like more specific prayers or guidance, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:50:48.484Z",
      "msg": "I want to not be opposed to the things of God I want my heart open to the leading of God and his will for my life I want to come out of doing Satan's bidding and living a transformed life in God's will"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:50:55.328Z",
      "msg": "It's great to hear your desire for transformation and openness to God's will! You can pray for a softened heart and guidance like this:\n\n\"Lord, I ask that you open my heart to your leading and your will for my life. Help me to turn away from anything that opposes you and to renounce the influence of Satan in my life. I seek a transformed life that aligns with your purpose. Please guide me and fill me with your Spirit so that I may walk in your ways.\"\n\nIf you need further support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:55:39.757Z",
      "msg": "I want satan removed from the throne in my life and I want God to sin on the throne of my life"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:55:44.655Z",
      "msg": "That's a powerful desire for change! You can pray a prayer like this:\n\n\"Father, I come before you and ask that you remove Satan from the throne of my life. I surrender my heart and my will to you, asking that you take your rightful place as the King of my life. Fill me with your Spirit and guide me in your ways. I want to live for you and honor you in all that I do.\"\n\nIf you would like more prayers or guidance, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:56:53.717Z",
      "msg": "Holy living holy talking holy desires holy eyes"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:56:59.750Z",
      "msg": "It sounds like you're seeking a deep commitment to holiness in every aspect of your life. You can pray for these desires like this:\n\n\"Lord, I ask for your help in living a holy life. Please transform my thoughts, my words, and my desires to reflect your holiness. Help me to see with holy eyes and to speak with a heart that honors you. I desire to be set apart for you and to live in a way that pleases you.\"\n\nIf you need more specific prayers or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T00:58:00.944Z",
      "msg": "I repent of any blasphemy or slander I have uttered"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T00:58:07.779Z",
      "msg": "That's a sincere and important step in your journey. You can pray a prayer of repentance like this:\n\n\"Father, I come before you with a humble heart, repenting of any blasphemy or slander I have spoken. I ask for your forgiveness and cleansing. Help me to guard my words and to speak only what is pleasing to you. Thank you for your grace and mercy.\"\n\nIf you need further support or guidance, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T01:02:39.608Z",
      "msg": "I repent of hypocrisy and I ask to be truly serving and knowing God and living a transformed life in the kingdom"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T01:02:44.527Z",
      "msg": "It's wonderful to hear your desire for genuine service and transformation. You can express this in prayer like this:\n\n\"Lord, I repent of any hypocrisy in my life. I ask for your forgiveness and for a true heart that seeks to serve you wholeheartedly. Help me to know you deeply and to live a transformed life that reflects your kingdom. Guide me in your ways and fill me with your Spirit.\"\n\nIf you need more resources or support on this journey, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-30T01:05:45.440Z",
      "msg": "I want my hands cleansed of blood shed and I want to hear the voice of God and I want his leading me to where I need to be in this lifetime"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-30T01:05:50.089Z",
      "msg": "Your desire for cleansing and guidance is truly heartfelt. You can pray like this:\n\n\"Lord, I ask for your cleansing over my hands and my heart. I long to hear your voice and to be led by you in every step of my life. Please guide me to where I need to be and help me to follow your will faithfully. I trust in your perfect plan for me.\"\n\nIf you need further support or specific prayers, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}