{
  "id": "af0919b0-7cec-11ef-814a-136ef61b800e",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Raleigh"
  },
  "messageCount": 14,
  "chatDuration": 1386,
  "rating": 0,
  "createdOn": "2024-09-27T16:22:58.537Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-09-27T16:22:58.537Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:28:11.038Z",
      "msg": "I want to be delivered from all sexual sins I pray for the ability to resist all temptations to commit sexual sins I want my will to be separated from satans will"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:28:17.660Z",
      "msg": "We're here to support you in your journey towards healing. Let's pray together for your deliverance from sexual sins and for the strength to resist temptations. \n\nHeavenly Father, we come before you today, asking for deliverance from all sexual sins. We pray for the ability to resist temptations and for our will to be aligned with Yours, separated from the enemy's influence. We trust in Your power to heal and restore us. In the name of Jesus Christ, we claim victory over these struggles. Amen.\n\nIf you need further guidance or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:30:51.469Z",
      "msg": "I pray for my spiritual eyes to be open to the things of God and for me to be able to kill the flesh and all it's enlurements"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:31:01.651Z",
      "msg": "That's a powerful prayer! Let's join together in seeking God's guidance and strength.\n\nHeavenly Father, we pray for spiritual eyes to be opened to Your truth and the things of God. We ask for the ability to put to death the flesh and all its allurements. Help us to focus on You and to seek Your will above all else. In Jesus' name, we pray. Amen.\n\nIf you need more resources or support, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:33:03.259Z",
      "msg": "I want my temple cleansed from all defilement through sexual sin and i pray for clarity to know God's will and I pray for deliverance from any demonic influence that causes me to commit sexual sins"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:33:08.700Z",
      "msg": "Let's pray together for your temple to be cleansed and for clarity in knowing God's will.\n\nHeavenly Father, we come before You, asking for cleansing from all defilement caused by sexual sin. We pray for clarity to understand Your will for our lives. We also seek deliverance from any demonic influence that leads us into temptation and sin. Fill us with Your Holy Spirit and guide us in the path of righteousness. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:36:42.202Z",
      "msg": "I pray that my finances will be released from the hands of satan I ask to forgive me for every way that I have put him to shame through my sexual sins I pray for the holiness I need to see God and for my holy and spiritual eyes to be awakened"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:36:50.217Z",
      "msg": "Let's lift up your prayers together.\n\nHeavenly Father, we pray for the release of finances from the hands of Satan. We ask for Your forgiveness for any ways we have put You to shame through our sexual sins. We seek the holiness needed to see You and ask that our spiritual eyes be awakened to Your truth and guidance. Fill us with Your light and help us walk in purity. In the name of Jesus Christ, we pray. Amen.\n\nIf you need additional support or resources, I'm here to help!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:39:01.608Z",
      "msg": "I renounce all agreements I have made with Satan through sexual sins lies and deception"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:39:07.589Z",
      "msg": "That's a powerful declaration! Let's pray together for your renouncement.\n\nHeavenly Father, we come before You to renounce all agreements made with Satan through sexual sins, lies, and deception. We break these ties and declare freedom in the name of Jesus Christ. We ask for Your strength to walk in truth and purity, and for Your guidance as we turn away from these past agreements. Thank You for Your forgiveness and for the new life we have in You. Amen.\n\nIf you need further support or resources, feel free to let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:42:30.889Z",
      "msg": "I loose myself from Satan and all demonic influences working against my true identity in Christ"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:42:39.189Z",
      "msg": "Let's pray for your freedom and identity in Christ.\n\nHeavenly Father, we come before You to loose ourselves from Satan and all demonic influences that work against our true identity in Christ. We declare that we are made new in You and that no weapon formed against us shall prosper. Help us to walk in the truth of who we are in You, filled with Your love and strength. In the name of Jesus Christ, we pray. Amen.\n\nIf you need any additional support or resources, I'm here to assist you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-27T16:45:52.045Z",
      "msg": "Lastly I come against everything that keeps me from walking in God's truth I renounce my way and satans way and I choose God's way I release myself from worldly living thinking and talking"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-27T16:46:04.223Z",
      "msg": "Let's pray together for your commitment to God's truth.\n\nHeavenly Father, we come against everything that keeps us from walking in Your truth. We renounce our ways and Satan's ways, choosing instead to follow Your path. We release ourselves from worldly living, thinking, and talking. Fill us with Your Spirit and guide us in living a life that honors You. Thank You for Your grace and for the transformation You bring. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further guidance or resources, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}