{
  "id": "09dbbab0-f479-11ef-ab70-7b5b2428be10",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1740598616468524",
    "id": "628ed4ee7b967b11799146e8-u2DneNtza__EEpI8ZOwzt",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Lebanon"
  },
  "messageCount": 10,
  "chatDuration": 2073,
  "rating": 0,
  "createdOn": "2025-02-26T19:37:27.453Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-02-26T19:37:27.453Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-26T19:46:17.402Z",
      "msg": "Hello my name is Heather"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-26T19:46:19.667Z",
      "msg": "Hi Heather! Welcome to FightLust.com! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-26T19:56:46.298Z",
      "msg": "I am struggling with lust spirits that are not leaving my life. I have repented and renounced my past sins. I have confessed Jesus Christ as my Lord and Savior in front of my new church and I was baptized in the name of the Father, the Son and Holy Spirit. I’ve been struggling with what I believe to be an Incubus or spirit spouse. I am following God, active in my church worshipping, Bible study and beginning a journey of discipleship program on March 7 th. I was baptized January 24th. I don’t know how to get rid of it other than all I’ve done. Constant prayer. Making it known to people. Fighting against it with the sword of the spirit you name it!"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-26T19:56:51.350Z",
      "msg": "Heather, it sounds like you are truly committed to your journey of faith and healing. It's great to hear that you are actively involved in your church and have taken significant steps like baptism and confession. \n\nFor your struggle with lust spirits, including what you believe to be an Incubus or spirit spouse, I encourage you to continue with constant prayer and seek support from your church community. You might find it helpful to pray specific deliverance prayers that address these spirits. \n\nHere’s a prayer you can consider: \n\n\"We break ungodly soul ties with former lovers and sexual partners. In the name of Jesus Christ, we cast out all spirits of loneliness that would drive us to ungodly sexual relationships. We command all spirits of Incubus and Succubus to leave now in the name of Jesus Christ. We receive the Spirit of holiness in our lives now to walk in sexual purity.\"\n\nRemember, you are not alone in this fight, and reaching out for support is a strong step. If you have any specific prayer requests or need further guidance, feel free to share!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-26T20:06:01.029Z",
      "msg": "I continue praying and reaching out to ministries. I have no one that seems to be willing to pray with me in real time. Everyone just keeps telling me to do what I’m doing. So I do. I have a lot of distress over it. I have overcome so many sins. Not just lust."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-26T20:06:09.251Z",
      "msg": "I'm really sorry to hear that you're feeling distressed, Heather. It’s commendable that you have overcome many sins and are actively seeking healing. It can be tough when it feels like you're not getting the support you need in real time.\n\nIf you're looking for someone to pray with you, I encourage you to share your prayer request with us. We are here to pray with you and for you. Remember, you are not alone in this journey, and your perseverance is a testament to your faith. \n\nIf you want, I can guide you through some specific prayers or scriptures that may help you in your situation. Just let me know how you'd like to proceed!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-26T20:08:16.142Z",
      "msg": "I would like for you to pray for my deliverance from lust spirits and any prayers or scripture you can give me would be helpful."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-26T20:08:28.511Z",
      "msg": "Absolutely, Heather. Here’s a prayer for your deliverance from lust spirits:\n\n\"Heavenly Father, I come before you in the name of Jesus Christ. I ask for your divine intervention in my life. I renounce all spirits of lust, including any Incubus or spirit spouse that may be tormenting me. I break all ungodly soul ties and command these spirits to leave me now in the name of Jesus. Fill me with your Holy Spirit and help me walk in purity and righteousness. I trust in your strength to overcome these challenges. Thank you for your love and grace. Amen.\"\n\nHere are some scriptures that may provide you with strength and encouragement:\n\n1. **1 John 1:9** - \"If we confess our sins, He is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.\"\n2. **Romans 12:1** - \"I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, holy, acceptable to God, which is your reasonable service.\"\n3. **Galatians 5:16** - \"I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh.\"\n4. **James 4:7** - \"Therefore submit to God. Resist the devil and he will flee from you.\"\n\nContinue to lean on God and His Word, and remember that you are not alone in this fight. If you need further support or specific prayers, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-26T20:11:53.079Z",
      "msg": "Thank you"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-26T20:12:00.011Z",
      "msg": "You're very welcome, Heather! If you have any more questions or need further support, don't hesitate to reach out. Remember, we're here for you. Stay strong in your journey!"
    }
  ],
  "domain": "fightlust.com"
}