{
  "id": "3d15b0d0-0364-11f0-8cf7-7905323f4b72",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1742238950458509",
    "id": "628ed4ee7b967b11799146e8-g18fVnvyUa6fEVuirpVkb",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Hyattsville"
  },
  "messageCount": 4,
  "chatDuration": 64,
  "rating": 0,
  "createdOn": "2025-03-17T19:16:21.439Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-03-17T19:16:21.439Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-17T19:16:36.987Z",
      "msg": "prayer"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-17T19:16:44.169Z",
      "msg": "Struggling with pornography or sexual addiction? We're here to offer guidance and prayer. How can we assist you today? Would you like to share a specific prayer request?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-17T19:17:18.024Z",
      "msg": "yes prayer against the spirit of untimely death, pride and lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-17T19:17:25.656Z",
      "msg": "Here’s a prayer you can use to address those concerns:\n\n---\n\nHeavenly Father, we come before you today, seeking your protection and guidance. We pray against the spirit of untimely death, asking for your divine intervention in our lives. We renounce any spirit of pride that may lead us away from your path and ask for humility to fill our hearts. \n\nLord, we also come against the spirit of lust that seeks to ensnare us. We ask for your strength to resist temptation and to walk in purity. Fill us with your Holy Spirit, and help us to live according to your will. We trust in your promises and seek your grace to overcome these challenges. \n\nIn the name of Jesus Christ, we pray. Amen.\n\n---\n\nIf you need further support or specific scriptures, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}