{
  "id": "c60ca9c0-80fb-11ef-bbce-17e5e115aa1a",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1727900431808631",
    "id": "628ed4ee7b967b11799146e8-OphQ5Cyzm_2w0vfE3Xp_Q",
    "email": null
  },
  "location": {
    "countryCode": "ZA",
    "city": "Cape Town"
  },
  "messageCount": 12,
  "chatDuration": 315,
  "rating": 0,
  "createdOn": "2024-10-02T20:21:57.611Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-02T20:21:57.611Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:22:26.368Z",
      "msg": "im looking for a pastor to confide"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:22:35.587Z",
      "msg": "Struggling with pornography or sexual addiction? We're here to offer guidance and prayer. If you need someone to talk to, I can help you find the support you need. Would you like assistance in connecting with a pastor or a Christian friend?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:24:09.485Z",
      "msg": "a pastor"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:24:13.851Z",
      "msg": "If you're looking for a pastor to confide in, I recommend reaching out to your local church or a Christian community in your area. They can provide you with the support and guidance you need. If you have any other questions or need further assistance, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:25:00.861Z",
      "msg": "i just came from watching porn and musterbated and i feel bad :("
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:25:06.684Z",
      "msg": "Feeling discouraged by setbacks is completely understandable. We're here to offer encouragement and remind you of God's grace. Remember, you are not alone in this struggle. Would you like to share a prayer request? We're here to pray with you and for you."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:25:26.349Z",
      "msg": "yes please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:25:32.016Z",
      "msg": "Please share your prayer request, and I'll be here to pray with you and for you. What specific concerns or feelings would you like us to pray about?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:26:21.293Z",
      "msg": "i want to defeat lust, musterbation, pornography,,,sexaual sin"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:26:27.556Z",
      "msg": "Heavenly Father, we come before you today, seeking strength and guidance for our friend who is struggling with lust, masturbation, pornography, and sexual sin. We ask for your forgiveness and for the power to overcome these temptations. Help them to focus on your beauty and to find satisfaction in you alone. May they feel your presence and love as they seek healing and freedom in Christ. In Jesus' name, we pray. Amen.\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T20:27:07.866Z",
      "msg": "thank u very much"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T20:27:13.103Z",
      "msg": "You're very welcome! If you need anything else or just want to talk, I'm here for you. Remember, you're not alone in this journey. How can I support you further today?"
    }
  ],
  "domain": "fightlust.com"
}