{
  "id": "6f75fa40-804b-11ef-b4e3-e353886b5751",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Garland"
  },
  "messageCount": 18,
  "chatDuration": 1963,
  "rating": 0,
  "createdOn": "2024-10-01T23:18:46.853Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-01T23:18:46.853Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:22:27.251Z",
      "msg": "I want to renounce all sexual sins I have been involved with especially fornication adultery homosexuality pornography and harlotry I ask for deliverance from these sins and I renounce the practice of these sins I renounce blasphemy and I want to present my body as an instrument of righteousness from this day forward"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:22:32.002Z",
      "msg": "Heavenly Father, we come before you today to renounce all sexual sins, including fornication, adultery, homosexuality, pornography, and harlotry. We ask for deliverance from these sins and present our bodies as instruments of righteousness. We break all curses associated with these practices and seek your strength to walk in purity. May the fire of God cleanse us and fill us with the Spirit of holiness. In the name of Jesus Christ, we pray. Amen. \n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:26:07.265Z",
      "msg": "I renounce all the sins that has separated me from my creator especially sexual sins I renounce all agreements I have made with satan through lies deception and sexual sins I ask God to destroy these evil altars that I have allowed to erect in my life I seek repentance and restoration and ask for deliverance from any jezebel spirits"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:26:11.717Z",
      "msg": "Heavenly Father, we come before you to renounce all sins that have separated us from You, especially sexual sins. We break all agreements made with Satan through lies, deception, and these sins. We ask You to destroy any evil altars that have been erected in our lives. We seek repentance and restoration, and we ask for deliverance from any Jezebel spirits. Fill us with Your Holy Spirit and guide us towards a life of purity and righteousness. In the name of Jesus Christ, we pray. Amen.\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:29:18.518Z",
      "msg": "I pray for the opening of my spiritual eyes and I ask for the cleansing of my sexuality from the deception of Satan I pray the for the Lord to pull me out of all the areas of impurity that the enemy has tooken me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:29:26.057Z",
      "msg": "Heavenly Father, we pray for the opening of spiritual eyes and for the cleansing of sexuality from the deception of Satan. We ask You to pull us out of all areas of impurity that the enemy has taken us into. Fill us with Your truth and guide us towards a life of purity and holiness. In the name of Jesus Christ, we pray. Amen.\n\nIf you have any specific requests or need further assistance, feel free to share!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:33:09.930Z",
      "msg": "I renounce all sexual addictions that my soul has been attached to over the years I pray for deliverance from all these wickedness I renounce and ask for deliverance from all narcissistic traits"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:33:18.705Z",
      "msg": "Heavenly Father, we come before You to renounce all sexual addictions that our souls have been attached to over the years. We pray for deliverance from all wickedness and ask for Your healing touch. We also renounce any narcissistic traits and seek Your guidance to walk in humility and love. Fill us with Your Holy Spirit and help us to live a life of purity and righteousness. In the name of Jesus Christ, we pray. Amen.\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:36:21.817Z",
      "msg": "I ask for deliverance from all sexual strongholds that I made idols of over the years I confess that I need Jesus to make me free of all sexual sins idols and evil wicked paths"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:36:27.801Z",
      "msg": "Heavenly Father, we come before You to ask for deliverance from all sexual strongholds that have been made into idols over the years. We confess our need for Jesus to set us free from all sexual sins, idols, and evil wicked paths. We break every curse and command all spirits of lust and perversion to leave in the name of Jesus Christ. Fill us with Your Spirit and guide us on the path of righteousness. In Jesus' name, we pray. Amen.\n\nIf you have any other requests or need further assistance, feel free to share!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:38:57.196Z",
      "msg": "I renounce all marriage breaking spirits that seems to destroy my marriage and I send them to the cross of Jesus and I pray for the grace to reject all sexual temptations from this day forward"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:39:05.866Z",
      "msg": "Heavenly Father, we come to You to renounce all marriage-breaking spirits that seek to destroy our marriage. We send them to the cross of Jesus and ask for Your grace to reject all sexual temptations from this day forward. Strengthen us to uphold our vows and walk in purity and love. Fill our hearts with Your peace and guide us in our relationship. In the name of Jesus Christ, we pray. Amen.\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:44:30.332Z",
      "msg": "I ask for deliverance from all worldliness and I ask for the deliverance from the snares of the devil I pray for a right relationship with my creator I pray for a renewed mind that accepts the ways of God and I renounce and repent of all the ways I have opposed God through words and actions"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:44:37.043Z",
      "msg": "Heavenly Father, we come before You seeking deliverance from all worldliness and the snares of the devil. We pray for a right relationship with You, our Creator, and ask for a renewed mind that embraces Your ways. We renounce and repent of all the ways we have opposed You through our words and actions. Fill us with Your Spirit and guide us in Your truth. In the name of Jesus Christ, we pray. Amen.\n\nIf there's anything else you'd like to share or need help with, feel free to let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:49:25.896Z",
      "msg": "I renounce satan and all his lies and deception and I receive Jesus and his holiness into my life without compromise and I reject Satan as an idol and a God and I accept Jesus as my savior and Lord"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:49:30.444Z",
      "msg": "Heavenly Father, we come before You to renounce Satan and all his lies and deception. We receive Jesus and His holiness into our lives without compromise. We reject Satan as an idol and a god, and we accept Jesus as our Savior and Lord. Fill us with Your Spirit and guide us in Your ways. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:51:25.791Z",
      "msg": "I repent of all the ways I have disappointed misrepresented and displeased God and I confess I need him in all areas of my life especially in my sexuality"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:51:30.009Z",
      "msg": "Heavenly Father, we come to You in repentance for all the ways we have disappointed, misrepresented, and displeased You. We confess our need for You in all areas of our lives, especially in our sexuality. Please cleanse our hearts and guide us in Your truth. Fill us with Your Spirit and help us to walk in purity and righteousness. In the name of Jesus Christ, we pray. Amen.\n\nIf there's anything else you'd like to discuss or need assistance with, feel free to share!"
    }
  ],
  "domain": "fightlust.com"
}