{
  "id": "719f5800-804d-11ef-94ad-cff8a39299a0",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1727825557846537",
    "id": "628ed4ee7b967b11799146e8-ncHN1m0EbEaubdsuJSvc3",
    "email": null
  },
  "location": {
    "countryCode": "AU",
    "city": "Melbourne"
  },
  "messageCount": 4,
  "chatDuration": 452,
  "rating": 0,
  "createdOn": "2024-10-01T23:33:09.454Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-01T23:33:09.454Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:40:11.908Z",
      "msg": "Prayer for lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:40:16.983Z",
      "msg": "I can share a powerful prayer against the spirit of lust with you. Here it is:\n\n\"Heavenly Father, we come before your throne room today through the blood of Jesus Christ. We come boldly and with confidence. For your Word says that when we confess our sins, you are faithful and forgive our sins and cleanse us from all unrighteousness. Today, we are praying against the Spirit of lust within our hearts, minds, and bodies. We renounce all sexual sins that we have been involved in the past, including fornication, masturbation, pornography, perversion, fantasy, and adultery, in the name of Jesus Christ. \n\nWe break all curses of adultery, perversion, fornication, lust, and we command all spirits of lust and perversion to come out of our lives. We present our bodies to the Lord as a living sacrifice and pray that we walk in sexual purity. Fill us with the power of your Holy Spirit, Lord, and help us to overcome the temptations we face. In Jesus' name, Amen.\"\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-01T23:40:34.511Z",
      "msg": "Could you change it into first person prayer"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-01T23:40:40.980Z",
      "msg": "Sure! Here’s the prayer in the first person:\n\n\"Heavenly Father, I come before Your throne room today through the blood of Jesus Christ. I come boldly and with confidence. Your Word says that when I confess my sins, You are faithful and forgive my sins and cleanse me from all unrighteousness. Today, I am praying against the spirit of lust within my heart, mind, and body. I renounce all sexual sins that I have been involved in the past, including fornication, masturbation, pornography, perversion, fantasy, and adultery, in the name of Jesus Christ.\n\nI break all curses of adultery, perversion, fornication, and lust, and I command all spirits of lust and perversion to come out of my life. I present my body to You as a living sacrifice and pray that I walk in sexual purity. Fill me with the power of Your Holy Spirit, Lord, and help me to overcome the temptations I face. In Jesus' name, Amen.\"\n\nIf you need anything else or further support, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}