{
  "id": "d1d59830-8050-11ef-9f67-ed050d88799e",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Garland"
  },
  "messageCount": 6,
  "chatDuration": 561,
  "rating": 0,
  "createdOn": "2024-10-01T23:57:20.838Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-10-01T23:57:20.838Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T00:01:12.722Z",
      "msg": "I repent and renounce all the ways I have misused my sexuality and my body for evil I ask for deliverance from the spirit of lust fornication harlotry lying adultery coveting and homosexuality"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T00:01:19.884Z",
      "msg": "Thank you for sharing your heart. We are here to support you in your journey towards healing. Would you like me to guide you through a prayer for deliverance or provide you with specific resources?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T00:01:34.663Z",
      "msg": "Yes"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T00:01:37.641Z",
      "msg": "Let's pray together:\n\n\"Dear Lord, I come before you with a humble heart, seeking your forgiveness and deliverance. I repent for the ways I have misused my sexuality and my body. I ask for your strength to overcome the spirit of lust, fornication, harlotry, lying, adultery, coveting, and homosexuality. Please cleanse me and fill me with your Holy Spirit. Help me to walk in purity and righteousness. In Jesus' name, Amen.\"\n\nIf you need further support or resources, feel free to let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-10-02T00:06:35.398Z",
      "msg": "I renounce all sexual addiction I want to stop serving the enemy with my life my lifestyle my sexuality my words my thoughts I want to commit all my ways to my creator I repent for all the ways I have displeased God over the years I want to surrender my ways to his ways and my will to his will"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-10-02T00:06:42.022Z",
      "msg": "It's wonderful to hear your desire for surrender and commitment to your Creator. Let's pray together:\n\n\"Heavenly Father, I come before you today to renounce all sexual addiction and the ways I have served the enemy with my life, lifestyle, sexuality, words, and thoughts. I repent for all the ways I have displeased you over the years. I surrender my ways to your ways and my will to your will. Please guide me and help me to live a life that honors you. In Jesus' name, Amen.\"\n\nIf you need additional support or resources, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}