{
  "id": "399759c0-4228-11ef-a9bc-3b5039a80ce3",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1720992600301842",
    "id": "628ed4ee7b967b11799146e8-Hmwr5vslHr9_wTPT9_Z2k",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 4,
  "chatDuration": 609,
  "rating": 0,
  "createdOn": "2024-07-14T21:30:31.705Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-07-14T21:30:31.705Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-07-14T21:39:38.358Z",
      "msg": "Please pray for me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-07-14T21:39:42.128Z",
      "msg": "Of course, I'd be honored to pray for you. Is there something specific you'd like prayer for, or would you prefer a general prayer?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-07-14T21:40:35.008Z",
      "msg": "Nasty sexual or hateful thoughts towards people even kids. I can’t take it anymore"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-07-14T21:40:41.065Z",
      "msg": "I'm so sorry to hear that you're struggling with these thoughts. Let's pray together:\n\nHeavenly Father, we come before Your throne today through the blood of Jesus Christ. We come boldly and with confidence, as Your Word says in Ephesians 3:12. We confess our sins and ask for Your forgiveness, knowing that You are faithful and just to cleanse us from all unrighteousness, as stated in 1 John 1:9.\n\nLord, we pray against the spirit of lust and any hateful thoughts that torment our minds. We renounce all sexual sins and any ungodly thoughts, asking for Your deliverance and healing. We break all curses of perversion, lust, and any other unclean spirits in the name of Jesus Christ. We present our bodies to You as a living sacrifice, holy and acceptable, according to Romans 12:1.\n\nFather, we ask that You fill us with Your Holy Spirit and renew our minds. Help us to focus on things that are pure, lovely, and of good report. We pray for Your peace to guard our hearts and minds in Christ Jesus.\n\nIn Jesus' name, we pray. Amen.\n\nIf you need further support or resources, please let me know. We're here to help you through this journey."
    }
  ],
  "domain": "fightlust.com"
}