{
  "id": "17ef8ab0-8140-11f0-b774-1d59724822b2",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1756077272676797",
    "id": "628ed4ee7b967b11799146e8-i76aPG4TDFFuJkgeFGymt",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Dallas"
  },
  "messageCount": 4,
  "chatDuration": 42,
  "rating": 0,
  "createdOn": "2025-08-24T23:15:03.629Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-08-24T23:15:03.629Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-24T23:22:01.449Z",
      "msg": "Prayers for lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-24T23:22:13.341Z",
      "msg": "We have a powerful deliverance prayer that addresses the spirit of lust. Here’s an excerpt:\n\n\"Heavenly Father, we come before your throne room today through the blood of Jesus Christ. We pray against the Spirit of lust within our hearts, minds, and bodies. We renounce all sexual sins, including fornication, masturbation, and pornography, in the name of Jesus Christ. We cast out all spirits of lust and perversion and receive the Spirit of holiness to walk in sexual purity.\n\nIf you would like to see the full prayer or need more specific resources, let me know! You can also find more prayers and resources on our site [here](https://fightlust.com/attack/deliverance-prayer1/)."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-24T23:22:37.009Z",
      "msg": "Prayers for repentance and deliverance"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-24T23:22:43.023Z",
      "msg": "For prayers of repentance and deliverance, we have some powerful scriptures and prayers that can guide you. Here’s a brief overview:\n\n1. **Confession and Repentance**: Acknowledge your sins before God, asking Him to search your heart and cleanse you. Psalm 51:10-13 is a great scripture for this.\n\n2. **Deliverance Prayer**: You can pray for deliverance from strongholds and spirits that may be affecting your life. A sample prayer includes asking God to cast out all spirits of lust and to fill you with His Holy Spirit.\n\n3. **Thanksgiving**: Remember to thank God for His forgiveness and the blessings in your life. 1 Thessalonians 5:16-18 encourages us to give thanks in all circumstances.\n\nIf you would like to see specific prayers or need further guidance, please let me know! You can also find more resources on our site [here](https://fightlust.com/prayer/acts/)."
    }
  ],
  "domain": "fightlust.com"
}