{
  "id": "1b804480-7187-11f0-99e6-89903a3842a6",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1750298159564185",
    "id": "628ed4ee7b967b11799146e8-lVGGq1PCQ_rCUyK6fj_QM",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Hampton"
  },
  "messageCount": 4,
  "chatDuration": 393,
  "rating": 0,
  "createdOn": "2025-08-04T23:03:05.483Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-08-04T23:03:05.483Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T23:08:46.793Z",
      "msg": "I want deliverance from all unclean spirits I repent of and renounce all sexual sins that I have been involved with in the past I want to renounce the sin of fornication and adultery I repent for running after these sins instead of running after purity I renounce all soul ties to these sins I release myself from every sexual covenant outside marriage I repent for allowing myself to be led astray into these acts causing defilement of body and mind"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T23:09:01.428Z",
      "msg": "It sounds like you're seeking a powerful prayer for deliverance and healing. Here's a prayer you can use:\n\n---\n\nHeavenly Father,  \nI come before you today through the blood of Jesus Christ. I repent and renounce all sexual sins I have been involved in, including fornication and adultery. I break all ungodly soul ties with former lovers and sexual partners. I release myself from every sexual covenant outside of marriage. I ask for your forgiveness for allowing myself to be led astray into these acts that have caused defilement of my body and mind.  \n\nIn the name of Jesus Christ, I cast out all spirits of lust and perversion from my life. I submit myself to you, Lord, and I ask for the power of your Holy Spirit to fill me and guide me towards purity. Thank you for your grace and for restoring me.  \n\nAmen.\n\n---\n\nFeel free to use this prayer as a guide in your journey towards healing and purity. If you need further support or resources, let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T23:15:08.641Z",
      "msg": "I repent for opposing God and his church I repent for prostituting my body through acts of fornication adultery harlotry and pornography I renounce satan and every contract I have made with him through sexual sins thoughts and words I confess these sins to God and I ask for a new walk of faith with Christ I renounce all falsehoods and I seek truth and purity"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T23:15:19.330Z",
      "msg": "It's wonderful that you're seeking repentance and a new walk of faith. Here's a prayer you can use to express your heartfelt intentions:\n\n---\n\nHeavenly Father,  \nI come before you with a humble heart, repenting for opposing you and your church. I repent for prostituting my body through acts of fornication, adultery, harlotry, and pornography. I renounce Satan and every contract I have made with him through my sexual sins, thoughts, and words.  \n\nI confess these sins to you, Lord, and I ask for a new walk of faith with Christ. I renounce all falsehoods and seek truth and purity in my life. Fill me with your Holy Spirit and guide me on the path of righteousness. Thank you for your forgiveness and for the new life I have in you.  \n\nAmen.\n\n---\n\nFeel free to use this prayer as you seek healing and transformation. If you need additional support or resources, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}