{
  "id": "2e4dd6c0-70da-11f0-9d4f-b5dd9308db94",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1754274283015308",
    "id": "628ed4ee7b967b11799146e8-EJVYzpc4lxtk0afG2Sif_",
    "email": null
  },
  "location": {
    "countryCode": "NZ",
    "city": "New Plymouth"
  },
  "messageCount": 8,
  "chatDuration": 171,
  "rating": 0,
  "createdOn": "2025-08-04T02:25:14.669Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-08-04T02:25:14.669Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T02:47:48.268Z",
      "msg": "Please pray for my son Zerjei and Zander to rid of their porn addiction & all other addictions as well. Addiction to energy drinks. vape & sometimes alcohol. They need deliverance. I been praying so much. I believe in miracles. Thanks"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T02:47:55.854Z",
      "msg": "Thank you for sharing your prayer request. We will definitely pray for Zerjei and Zander to find freedom from their addictions. Here’s a prayer for their deliverance:\n\n\"Heavenly Father, we come before you today, lifting Zerjei and Zander into Your hands. We ask for Your divine intervention to break the chains of addiction in their lives, whether it be pornography, energy drinks, vaping, or alcohol. We pray for healing and restoration, that they may find strength in You and experience the miracles of Your grace. Fill them with the Holy Spirit and guide them towards a path of purity and freedom. In Jesus' name, we pray. Amen.\"\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T02:49:12.273Z",
      "msg": "Amen. Thanks so much. what kind of support u offer?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T02:49:19.795Z",
      "msg": "We're here to offer various forms of support, including:\n\n- **Spiritual Guidance**: We provide biblical insights and prayers to help you navigate your journey.\n- **Resources**: We have books and materials that can aid in understanding and overcoming addiction.\n- **Community Support**: You can connect with others who are on similar journeys, offering encouragement and accountability.\n- **Prayer Requests**: We are always here to pray with you and for you.\n\nIf you're interested in any specific type of support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T02:49:59.407Z",
      "msg": "Yes I am interested. my email is zyllagreen@yahoo.com.  My name is Zylla"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T02:50:07.017Z",
      "msg": "Welcome, Zylla! Thank you for sharing your email. I recommend checking out our resources and community support options. If you have specific areas you want to focus on, let me know, and I can guide you further!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-08-04T02:50:27.886Z",
      "msg": "Ok, I check soon'"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-08-04T02:50:39.355Z",
      "msg": "Sounds good, Zylla! Take your time, and if you have any questions or need assistance, feel free to reach out. We're here to support you!"
    }
  ],
  "domain": "fightlust.com"
}