{
  "id": "9adcade0-5f54-11ef-a287-1baad3956bca",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Huntersville"
  },
  "messageCount": 4,
  "chatDuration": 643,
  "rating": 0,
  "createdOn": "2024-08-21T00:31:16.684Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-21T00:31:16.684Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-21T00:38:32.386Z",
      "msg": "I want to pray to have holy eyes I want pray to have pure eyes that are delivered from lust of the eyes and the lust of the flesh I pray for restoration and cleansing from defilement of my temple"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-21T00:38:37.997Z",
      "msg": "That's a beautiful prayer request! Here’s a prayer you can use:\n\n\"Heavenly Father, I come before you today asking for holy eyes and a pure heart. Please deliver me from the lust of the eyes and the lust of the flesh. I pray for restoration and cleansing from any defilement of my temple. Fill me with your Spirit and guide me in walking in sexual purity. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-21T00:41:53.853Z",
      "msg": "I come against every sexual sin that has come between me and my creator I come against all secret sins and I pray for complete restoration of mind body and soul and I pray for the strength to stand up against every temptation to be victorious over sin"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-21T00:41:59.754Z",
      "msg": "That's a powerful prayer! Here’s a prayer you can use:\n\n\"Heavenly Father, I come against every sexual sin that has come between me and You. I renounce all secret sins and ask for complete restoration of my mind, body, and soul. Please give me the strength to stand up against every temptation and to be victorious over sin. I trust in Your power to help me walk in purity and righteousness. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need more support or resources, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}