{
  "id": "69c830d0-3cd6-11ef-8641-73709ff36b9f",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1720407706666160",
    "id": "628ed4ee7b967b11799146e8-zqrlPDuCZTBYDjbBFQa6B",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Washington"
  },
  "messageCount": 2,
  "chatDuration": 141,
  "rating": 0,
  "createdOn": "2024-07-08T03:02:17.619Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-07-08T03:02:17.619Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-07-08T03:04:30.309Z",
      "msg": "Hello, and God bless you I'm writing to recivev=e prayer and agreement to break the spirit of lust, masturbation and watching pornography the rumification and sin I break and bind the sould ties that keep me bound and away from my God ordained spouse and any curses or demons i invited through sin to me and my bloodline"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-07-08T03:04:38.602Z",
      "msg": "Hello, and God bless you too. Thank you for reaching out. Let's pray together:\n\nHeavenly Father, we come before Your throne today through the blood of Jesus Christ. We confess our sins and ask for Your forgiveness and cleansing from all unrighteousness. In the name of Jesus Christ, we break all curses of adultery, perversion, fornication, lust, incest, rape, molestation, harlotry, and polygamy. We command all spirits of lust and perversion to leave our bodies, minds, and spirits right now. We break ungodly soul ties with former lovers and sexual partners and cast out all spirits of loneliness that drive us to ungodly sexual relationships. We take authority over our thoughts and bind all spirits of fantasy and lustful thinking. We receive the Spirit of holiness in our lives now to walk in sexual purity. Fill us with the power of Your Holy Spirit, Lord. In Jesus' name, we pray. Amen.\n\nIf you need further support or resources, please let me know."
    }
  ],
  "domain": "www.fightlust.com"
}