{
  "id": "23266280-04e7-11f0-9950-4bae67623eb2",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1742403314773898",
    "id": "628ed4ee7b967b11799146e8-WuVcPTlZ2tbwuUAgyBkZD",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Lompoc"
  },
  "messageCount": 10,
  "chatDuration": 864,
  "rating": 0,
  "createdOn": "2025-03-19T17:25:53.609Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-03-19T17:25:53.609Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-19T17:26:25.963Z",
      "msg": "This prayer was powerful, thank you. I felt the holyspirit fill me with this. Praise the Lord"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-19T17:26:29.644Z",
      "msg": "That's wonderful to hear! Praise the Lord for the work He is doing in your life. If you have any specific prayer requests or need further support, feel free to share. We're here to help you on your journey!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-19T17:28:36.657Z",
      "msg": "I need deliverance from things but I know God will. Thank you. I wish I never sinned"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-19T17:28:40.926Z",
      "msg": "It's great to hear that you have faith in God's deliverance. Remember, we all struggle and fall short at times, but God's grace is always there to lift us up. If you'd like, I can guide you through some prayers or resources that can help you in your journey towards healing and freedom. Just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-19T17:35:34.347Z",
      "msg": "Thank you, that would be great"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-19T17:35:44.323Z",
      "msg": "You're welcome! Here’s a powerful deliverance prayer that you can use:\n\n\"Heavenly Father, we come before your throne room today through the blood of Jesus Christ. We come boldly and with confidence. For your Word says that when we confess our sins, you are faithful and forgive our sins and cleanse us from all unrighteousness. Today, we are praying against the Spirit of lust and all other sexual sins. We break all curses of lust and command all spirits of perversion to come out in the name of Jesus Christ. We present our bodies to you as a living sacrifice and ask for your healing and restoration.\"\n\nFeel free to pray this prayer and ask God for His strength and guidance. If you need more resources or specific prayers, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-19T17:38:57.207Z",
      "msg": "Pride"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-19T17:39:02.960Z",
      "msg": "It's important to recognize and address pride, as it can be a barrier in our relationship with God. You can pray for humility and ask God to help you overcome pride. Here’s a prayer you might find helpful:\n\n\"Heavenly Father, I come before you and acknowledge my struggles with pride. I ask for your forgiveness and for the strength to humble myself before you. Help me to see others as you see them and to serve with a heart of love and humility. I surrender my pride to you and ask for your grace to fill me. In Jesus' name, I pray. Amen.\"\n\nIf you need further support or resources on this topic, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-19T17:40:11.320Z",
      "msg": "Amen"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-19T17:40:17.243Z",
      "msg": "Amen! If you have any more prayers you'd like to share or if there's anything else you need support with, just let me know. I'm here to help!"
    }
  ],
  "domain": "fightlust.com"
}