{
  "id": "5d084300-63f3-11ef-8612-5751d1c05de6",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Raleigh"
  },
  "messageCount": 10,
  "chatDuration": 1027,
  "rating": 0,
  "createdOn": "2024-08-26T21:37:47.420Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-26T21:37:47.420Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-26T21:41:52.213Z",
      "msg": "I want to be released from the spirit of fornication adultery harlotry pornography masturbation homosexuality lust and lying I want the spirit of holiness in my life"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-26T21:41:56.685Z",
      "msg": "We're here to support you in your journey towards healing. Let's pray together for your release from these spirits and for the Spirit of holiness to fill your life. \n\nHeavenly Father, we come before you today, renouncing all sexual sins, including fornication, adultery, harlotry, pornography, masturbation, homosexuality, lust, and lying. We ask for your forgiveness and cleansing. Fill us with your Spirit of holiness and guide us to walk in purity. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-26T21:43:42.061Z",
      "msg": "I want all marriage breaking spirits to be broken in the name of Jesus I want to break off all agreements with Satan in regards to sexual sin"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-26T21:43:48.225Z",
      "msg": "Let's pray together for the breaking of all marriage-breaking spirits and any agreements with Satan regarding sexual sin.\n\nIn the name of Jesus Christ, we command all marriage-breaking spirits to be broken. We renounce and break off any agreements with Satan concerning sexual sin. We declare freedom and healing in your life, and we ask for the Spirit of holiness to fill you. \n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-26T21:47:20.672Z",
      "msg": "I pray for restoration of my marriage I pray for restoration of my soul and restoration of a right relationship with Jesus Christ"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-26T21:47:25.112Z",
      "msg": "Let's pray for the restoration of your marriage, your soul, and your relationship with Jesus Christ.\n\nHeavenly Father, we come before you, asking for the restoration of this marriage. Heal any wounds and bring reconciliation. Restore the soul of your child and renew their relationship with You, Lord. Fill them with Your love and guidance, and help them to walk in Your ways. \n\nIn the name of Jesus Christ, we pray. Amen.\n\nIf you need further assistance or resources, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-26T21:50:42.753Z",
      "msg": "I want the strength and ability from the spirit realm to resist every temptation from Satan to engage in any sexual sin I want my spiritual eyes revived and my sexuality restored to holiness"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-26T21:50:48.308Z",
      "msg": "Let's pray for strength and the ability to resist temptation, as well as for the revival of your spiritual eyes and the restoration of your sexuality to holiness.\n\nHeavenly Father, we ask for Your strength and ability to resist every temptation from Satan regarding sexual sin. Revive their spiritual eyes, Lord, and restore their sexuality to holiness. Fill them with Your Spirit and guide them in their journey towards purity and righteousness.\n\nIn the name of Jesus Christ, we pray. Amen.\n\nIf you need more support or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-26T21:54:45.862Z",
      "msg": "I release my self from all satanic agendas and open myself up to the salvation and holiness of God"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-26T21:54:54.193Z",
      "msg": "That's a powerful declaration! Let's pray together for your release from all satanic agendas and for you to fully embrace the salvation and holiness of God.\n\nHeavenly Father, we thank You for the commitment to release oneself from all satanic agendas. We ask that You fill them with Your salvation and holiness. May Your Spirit guide them in their journey towards purity and righteousness, and may they experience the fullness of Your grace and love.\n\nIn the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, feel free to reach out!"
    }
  ],
  "domain": "fightlust.com"
}