{
  "id": "87807f20-5daf-11ef-8e6e-fbd23c990947",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Charlotte"
  },
  "messageCount": 6,
  "chatDuration": 693,
  "rating": 0,
  "createdOn": "2024-08-18T22:17:05.868Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-08-18T22:17:05.868Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-18T22:26:03.509Z",
      "msg": "I'm just trying to live a holy life I have been in sexual sin for so long it just seems like that is who I am"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-18T22:26:06.602Z",
      "msg": "Struggling with pornography or sexual addiction? We're here to offer guidance and prayer. Remember, your identity is in Christ, not in your struggles. How can we assist you on your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-18T22:26:42.561Z",
      "msg": "Prayer"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-18T22:26:46.913Z",
      "msg": "Do you want to share a specific prayer request? We're here to pray with you and for you. If you're looking for guidance on how to pray about your struggles, I can help with that too!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-08-18T22:28:34.648Z",
      "msg": "I need prayer to come out of all sexual sins that I have been involved in"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-08-18T22:28:39.233Z",
      "msg": "Heavenly Father, we come before your throne today, seeking your strength and forgiveness. We renounce all sexual sins that we have been involved in, including fornication, masturbation, pornography, and adultery. In the name of Jesus Christ, we break all curses of lust and perversion. We ask for your healing and restoration, and we present our bodies to you as living sacrifices. Fill us with the power of your Holy Spirit to walk in sexual purity. Amen.\n\nIf you need further support or resources, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}