{
  "id": "2892fb60-ea71-11ef-810f-ffbc436db599",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1739495720399813",
    "id": "628ed4ee7b967b11799146e8-WpMj9owucEErgn475RDe0",
    "email": null
  },
  "location": {
    "countryCode": "CA",
    "city": "Calgary"
  },
  "messageCount": 10,
  "chatDuration": 322,
  "rating": 0,
  "createdOn": "2025-02-14T01:15:51.569Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-02-14T01:15:51.569Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-14T01:17:41.771Z",
      "msg": "Please pray for me. I had sex with my Socail Worker. I thought she was seperated but now she is working on her marraige again. She tested to see if she was pregnant and she is not. We repented of that."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-14T01:17:48.067Z",
      "msg": "Thank you for sharing your situation with me. It's important to seek healing and guidance during challenging times like this. I will pray for you and for both of you as you navigate this situation. Remember, God's grace is always available to help us through our struggles. If you have any specific prayer requests or need further support, feel free to share."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-14T01:19:03.929Z",
      "msg": "Healing my heart from this relationship. Restoration of my soul and hers. Are lives are interconnected. That we go forward in a way that honours God."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-14T01:19:10.917Z",
      "msg": "I will pray for healing for both you and her, asking for restoration of your souls and guidance as you move forward in a way that honors God. May you both find peace and strength in this journey. Remember, God is always there to support you. If you need any specific prayers or resources, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-14T01:19:47.991Z",
      "msg": "Thanks pastor Jeremy. Are u a real person or a bot?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-14T01:19:55.976Z",
      "msg": "You're welcome! I'm here to support you, but I'm actually a customer support assistant, not a real person. However, I'm dedicated to helping you with your needs and providing guidance. If you have any more questions or need assistance, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-14T01:20:39.284Z",
      "msg": "Do a customer support assistants prayers work?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-14T01:20:51.148Z",
      "msg": "While I may not be a person, the prayers and support offered here are rooted in faith and the belief that God hears and responds to our prayers. Many find comfort and strength in prayer, and it's a way to connect with God during difficult times. If you have specific prayer requests or need guidance, I'm here to help!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-14T01:21:04.073Z",
      "msg": "Ty"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-14T01:21:13.790Z",
      "msg": "You're welcome! If you need anything else or have more questions, feel free to reach out. I'm here to help!"
    }
  ],
  "domain": "fightlust.com"
}