{
  "id": "1693adc0-8ff2-11f0-b209-ef060cc0aa60",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1757693037164380",
    "id": "628ed4ee7b967b11799146e8-7Ok1UfHXzDat4VqkjBJ6E",
    "email": null
  },
  "location": {
    "countryCode": "MY",
    "city": "Unknown"
  },
  "messageCount": 4,
  "chatDuration": 105,
  "rating": 0,
  "createdOn": "2025-09-12T16:04:28.849Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-09-12T16:04:28.849Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-09-12T16:05:19.811Z",
      "msg": "confess to Yeshua on that I have committed sin of judging orhers"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-09-12T16:05:28.022Z",
      "msg": "It's great that you're seeking to confess and find healing. You can pray to Yeshua, acknowledging your sin of judgment and asking for His forgiveness. Remember, He is faithful and just to forgive us our sins. If you would like, I can guide you through some specific prayers or scriptures to help with your confession. Let me know how you'd like to proceed!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-09-12T16:06:53.141Z",
      "msg": "proceed as usual"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-09-12T16:07:05.057Z",
      "msg": "Here’s a prayer you can use to confess your sin of judging others:\n\n---\n\n**Confession Prayer:**\n\n\"Dear Yeshua, I come before You acknowledging my sin of judging others. I recognize that I have fallen short of Your grace and have not shown love and compassion as You have taught us. Please search my heart and reveal any areas where I need to change. I ask for Your forgiveness and cleansing. Create in me a clean heart, O God, and renew a right spirit within me. Help me to see others through Your eyes and to love them as You do. Thank You for Your mercy and grace. Amen.\"\n\n---\n\nFeel free to personalize this prayer as you feel led. If you need further guidance or support, just let me know!"
    }
  ],
  "domain": "fightlust.com"
}