{
  "id": "604c3510-9f28-11ef-b8a2-2dcc7816e6b5",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1731218123440801",
    "id": "628ed4ee7b967b11799146e8-ndAoG_PMuVJr_Dyeq6QZV",
    "email": null
  },
  "location": {
    "countryCode": "ZA",
    "city": "Johannesburg"
  },
  "messageCount": 16,
  "chatDuration": 403,
  "rating": 0,
  "createdOn": "2024-11-10T05:55:55.963Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-11-10T05:55:55.963Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:00.893Z",
      "msg": "Hello"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:05.548Z",
      "msg": "Welcome to FightLust.com! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:18.868Z",
      "msg": "I need deliverance"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:22.300Z",
      "msg": "Struggling with pornography or sexual addiction? We're here to offer guidance and prayer. How can we assist you in your journey towards deliverance?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:37.915Z",
      "msg": "Pornography"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T05:56:45.479Z",
      "msg": "We're here to help you with that. It's important to focus on Christ for true freedom from pornography. Would you like guidance on prayers or resources to support you in this journey?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T05:57:00.467Z",
      "msg": "Yes"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T05:57:03.755Z",
      "msg": "Great! We can provide you with prayers and resources to help you on your journey. Would you like to share a specific prayer request, or are you looking for general resources?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T05:59:30.491Z",
      "msg": "I would love to share a specific prayer request,I need deliverance from marine spirits,someone has made me a sacrifice,my whole body feels like it's burning especially my breast it like I'm breast feeding"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T05:59:35.872Z",
      "msg": "Thank you for sharing your prayer request. We are here to pray with you and for you. Let's pray for deliverance from marine spirits and for healing in your body. \n\nHeavenly Father, we come before you today, asking for your powerful intervention in this situation. We cast out all spirits that are not of you and ask for your healing touch. Please bring comfort and relief to this individual, and may they feel your presence and peace. In the name of Jesus Christ, we pray. Amen.\n\nIf you need further support or resources, please let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T06:00:33.607Z",
      "msg": "I need further support"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T06:00:40.321Z",
      "msg": "Absolutely! We can provide you with prayers and resources to help you in your journey. \n\nFor deliverance, you might find it helpful to pray the following:\n\n\"Lord, I come before you, asking for deliverance from any spirits that are not of you. I cast out all marine spirits and any strongholds in my life. Fill me with your Holy Spirit and guide me towards purity and healing. In Jesus' name, I pray. Amen.\"\n\nAdditionally, if you're interested, we can guide you to specific resources or support groups that focus on healing from sexual addiction and spiritual warfare. Would you like more information on that?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T06:01:24.367Z",
      "msg": "Yes please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T06:01:32.463Z",
      "msg": "We have several resources that can help you on your journey towards healing and deliverance. Here are a few options:\n\n1. **Books**: \n   - \"Breaking the Cycle: Free Yourself from Sex Addiction, Porn Obsession, and Shame\" - This book offers a step-by-step plan to help you break free from sexual compulsions.\n   - \"Healing the Wounds of Sexual Addiction\" - This book provides understanding and guidance for those struggling with sexual addiction.\n\n2. **Prayers**: \n   - You can find powerful prayers specifically designed to help with deliverance from sexual sin and strongholds. \n\n3. **Support Groups**: \n   - Joining a support group can provide you with community and encouragement. If you're interested, I can help you find information on how to connect with a group.\n\nIf you would like links to any specific resources or more details, just let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-11-10T06:02:30.315Z",
      "msg": "Yes please"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-11-10T06:02:39.329Z",
      "msg": "I can guide you to some resources that may be helpful:\n\n1. **Books**:\n   - \"Healing the Wounds of Sexual Addiction\" - This book points the way to understanding, wholeness, and holiness. You can find it in paperback [here](https://amz.run/5GVs) or on Audible [here](https://tinyurl.com/ykpua625).\n   - \"Victory in Spiritual Warfare\" - This book helps you understand how to tackle challenges with spiritual power. You can find it in paperback [here](https://amz.run/5GVu) or on Audible [here](https://tinyurl.com/2c3bxsbt).\n\n2. **Prayers and Deliverance Resources**:\n   - You can explore the \"Free Indeed\" series, which discusses how to close the doors we leave open to the enemy and what it means to be truly free. More information can be found [here](https://fightlust.com/freeindeed/).\n\n3. **Support Groups**:\n   - If you're looking for a community, I recommend checking out resources like [Samson Society](https://samsonsociety.com) for support and encouragement.\n\nIf you need anything else or have specific questions, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}