{
  "id": "d9afcb80-7e8d-11ef-8b23-79d94fec5cc8",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1721767894064228",
    "id": "628ed4ee7b967b11799146e8-fKfzMWIFGajomYV955jNe",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Raleigh"
  },
  "messageCount": 12,
  "chatDuration": 1447,
  "rating": 0,
  "createdOn": "2024-09-29T18:09:09.331Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-09-29T18:09:09.331Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:12:41.798Z",
      "msg": "I want to renounce the spirit of fornication I pray for deliverance from the spirit of fornication and adultery harlotry and pornography and masturbation and perversion I ask God to take these sins from me I confess that my flesh loves these sins but I confess them as sin against God and my body"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:12:46.546Z",
      "msg": "It's great that you're seeking deliverance and confessing these struggles. I encourage you to pray the following:\n\n\"Heavenly Father, I come before you today to renounce the spirit of fornication, adultery, harlotry, pornography, masturbation, and perversion. I ask for your deliverance from these sins. I confess that my flesh loves these sins, but I recognize them as sin against you and my body. Please cleanse me and help me walk in purity. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need further support or resources, feel free to ask!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:16:54.602Z",
      "msg": "I ask that heaven would send a holy hatred into my heart for these sins I confess these sins as idolatry and I pray for the altar of these sins to be destroyed and I come out of agreement with these sins I pray that God would align my will with his will for my life and that I would be able by his power to release all sexual sins from my life and be empowered to live a holy life free of deception lies and sexual sin"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:17:03.690Z",
      "msg": "It's powerful that you're seeking such a deep transformation. You can pray this:\n\n\"Heavenly Father, I ask that you send a holy hatred into my heart for these sins. I confess these sins as idolatry and pray for the altar of these sins to be destroyed. I come out of agreement with them and ask that you align my will with your will for my life. By your power, help me release all sexual sins from my life and empower me to live a holy life, free of deception, lies, and sexual sin. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need more support or guidance, I'm here to help!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:21:10.613Z",
      "msg": "I pray that I would have eyes for my wife and only my wife I pray that they will be no sexual contact with anyone outside my wife I pray that God would destroy the works of adultery fornication and harlotry in my life"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:21:17.359Z",
      "msg": "That's a heartfelt prayer for your marriage and commitment. You can pray this:\n\n\"Heavenly Father, I pray that I would have eyes for my wife and only my wife. I ask that there be no sexual contact with anyone outside of my marriage. Please destroy the works of adultery, fornication, and harlotry in my life. Help me to honor my wife and our commitment to each other. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need further assistance or resources, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:23:01.510Z",
      "msg": "I pray for all unclean spirits operating in my life to be destroyed by fire in Jesus name"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:23:08.669Z",
      "msg": "That's a powerful prayer for deliverance. You can pray this:\n\n\"Heavenly Father, I pray for all unclean spirits operating in my life to be destroyed by fire in the name of Jesus Christ. I ask for your cleansing and healing power to fill my life, removing anything that is not of you. Thank you for your deliverance and for setting me free. In Jesus' name, I pray. Amen.\"\n\nIf you need more support or guidance, I'm here to help!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:28:26.658Z",
      "msg": "I pray for all sexual strongholds to be broken off my soul spirit and will I want to also break the spirit of blasphemy off my life"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:28:31.634Z",
      "msg": "That's a sincere prayer for freedom. You can pray this:\n\n\"Heavenly Father, I pray for all sexual strongholds to be broken off my soul, spirit, and will in the name of Jesus Christ. I also ask for the spirit of blasphemy to be removed from my life. Please cleanse me and fill me with your Holy Spirit, guiding me towards purity and righteousness. Thank you for your deliverance and healing. In Jesus' name, I pray. Amen.\"\n\nIf you need further assistance or resources, feel free to reach out!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-09-29T18:33:09.687Z",
      "msg": "I pray for Grace to do the right with my body the things that are pleasing in God's sight I renounce hotel visits with women outside my marriage I renounce porn and masturbation and all perversions deliverance"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-09-29T18:33:15.934Z",
      "msg": "That's a heartfelt prayer for grace and deliverance. You can pray this:\n\n\"Heavenly Father, I pray for your grace to do what is right with my body and to engage in things that are pleasing in your sight. I renounce hotel visits with women outside my marriage, as well as pornography, masturbation, and all perversions. I ask for your deliverance and healing in my life. Help me to walk in purity and righteousness. In the name of Jesus Christ, I pray. Amen.\"\n\nIf you need more support or resources, I'm here to help!"
    }
  ],
  "domain": "fightlust.com"
}