{
  "id": "af895480-03a7-11f0-8410-c93cf43a471c",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1742267918728954",
    "id": "628ed4ee7b967b11799146e8-hMPz8yq7zgp1DzuC0nATZ",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 6,
  "chatDuration": 208,
  "rating": 0,
  "createdOn": "2025-03-18T03:19:09.855Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-03-18T03:19:09.855Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-18T03:20:06.525Z",
      "msg": "I just lust"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-18T03:20:21.822Z",
      "msg": "Struggling with lust can be challenging, but you're not alone. We're here to offer guidance and prayer. How can we assist you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-18T03:20:46.994Z",
      "msg": "Can u give a prayer for the list and forgiveness?"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-18T03:20:58.600Z",
      "msg": "Here's a prayer you can use for dealing with lust and seeking forgiveness:\n\n---\n\nHeavenly Father,  \nI come before you today, acknowledging my struggles with lust. I confess my sins and ask for your forgiveness. Your Word says that if we confess our sins, you are faithful and just to forgive us and cleanse us from all unrighteousness (1 John 1:9).  \n\nLord, I ask you to search my heart and reveal any areas that displease you. Create in me a clean heart, O God, and renew a right spirit within me (Psalm 51:10). I renounce all sexual sins and ask for your strength to overcome these temptations.  \n\nHelp me to walk in purity and to rely on your grace. Fill me with your Holy Spirit and guide me in my journey towards healing. Thank you for your love and forgiveness. In Jesus' name, I pray. Amen.\n\n---\n\nFeel free to modify it as you feel led. If you need more support or resources, let me know!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-18T03:22:25.017Z",
      "msg": "Thanks it help me a lot 😢"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-18T03:22:37.480Z",
      "msg": "I'm so glad to hear that it helped you! Remember, you're not alone in this journey. If you need someone to talk to or further support, feel free to reach out. We're here for you!"
    }
  ],
  "domain": "fightlust.com"
}