{
  "id": "0c342fc0-f791-11ef-84f1-2fa896221210",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1740938781838509",
    "id": "628ed4ee7b967b11799146e8-xHEMgvfZuWomSGr9U7elf",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Atlanta"
  },
  "messageCount": 6,
  "chatDuration": 296,
  "rating": 0,
  "createdOn": "2025-03-02T18:06:55.384Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-03-02T18:06:55.384Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-02T18:09:04.522Z",
      "msg": "Could you pray for me and come and agreement with me"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-02T18:09:07.578Z",
      "msg": "Absolutely! Please share your specific prayer request, and I'll join you in prayer. We're here to support you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-02T18:10:09.242Z",
      "msg": "Praying God will close all evil doorways that I have caused by my sin or masturbation and pornography and pray and come in agreement thank God will break me free for me strongholds and it's addiction my name is Travis Alexander"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-02T18:10:16.884Z",
      "msg": "Thank you for sharing your request, Travis. Let's pray together:\n\nHeavenly Father, we come before You today, lifting up Travis. We ask that You close all evil doorways that have been opened through sin, masturbation, and pornography. We pray for the breaking of strongholds and addictions in his life. Lord, we ask for Your strength and guidance to help him walk in freedom and purity. Fill him with Your Holy Spirit and help him to rely on You for victory. We thank You for Your love and grace. In Jesus' name, we pray. Amen.\n\nWe're here for you, Travis! If you need further support or resources, just let me know."
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-03-02T18:11:46.243Z",
      "msg": "Could you please keep me prayer and stay in touch with me my email address do you can I give it to you"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-03-02T18:11:51.240Z",
      "msg": "I'm here to support you, but I can't take personal information like email addresses. However, I encourage you to reach out whenever you need prayer or support. We're here for you! If you have any specific requests or need guidance, feel free to share."
    }
  ],
  "domain": "fightlust.com"
}