{
  "id": "194f7270-e1d7-11ef-9b87-69f5347df2ab",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1738549942999192",
    "id": "628ed4ee7b967b11799146e8-7kNdDLUPyPp9xQDr3wMop",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Kyle"
  },
  "messageCount": 4,
  "chatDuration": 620,
  "rating": 0,
  "createdOn": "2025-02-03T02:32:54.288Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-02-03T02:32:54.288Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-03T02:41:34.658Z",
      "msg": "Yes prayer 🙏🏽"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-03T02:41:40.535Z",
      "msg": "Absolutely! We are here to pray with you. Do you have a specific prayer request or something you'd like us to pray about?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-03T02:43:08.434Z",
      "msg": "Pray for me I’m living in sin , struggling with sexual immorality, pornography and masturbation. Living in lust ."
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-03T02:43:14.611Z",
      "msg": "Heavenly Father, we come before you today, lifting up our friend who is struggling with sexual immorality, pornography, and lust. We ask for your strength and guidance to help them overcome these challenges. \n\nLord, we pray that you cleanse their heart and mind, breaking any chains of sin that bind them. Help them to renounce all sexual sins and to seek freedom in Christ. Fill them with your Holy Spirit and guide them towards a life of purity and holiness. \n\nWe trust in your promise that when we confess our sins, you are faithful to forgive us and cleanse us from all unrighteousness. May they find comfort and strength in your Word and in the community of believers. \n\nIn the name of Jesus Christ, we pray. Amen. \n\nIf you need further support or resources, feel free to ask!"
    }
  ],
  "domain": "fightlust.com"
}