{
  "id": "18df7e30-277d-11ef-b83a-151ce72ff6a3",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1718060371286875",
    "id": "628ed4ee7b967b11799146e8-vyAbAKNX2OGNBlJR1KaPb",
    "email": null
  },
  "location": {
    "countryCode": "ZA",
    "city": "Unknown"
  },
  "messageCount": 4,
  "chatDuration": 745,
  "rating": 0,
  "createdOn": "2024-06-10T23:00:03.388Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-06-10T23:00:03.388Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-06-10T23:11:28.306Z",
      "msg": "Prayers for deliverance"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-06-10T23:11:32.888Z",
      "msg": "Absolutely, here is a powerful prayer for deliverance:\n\n\"Father, in the name of Jesus, we cast out all imagination thoughts right now. Satan, every stronghold you have tried to bring against us is being rendered helpless, powerless, and ineffective to operate in our lives from today by the authority of our Lord Jesus Christ. We put off all forms of lust, the old nature, and adopt the new nature of righteousness, purity, and honesty, today! In the name of Jesus Christ, Satan, in our life, you are defeated today. And now you're under our feet, and the power of lust in sin is broken today. Father, we thank you for hearing our prayers, delivering us from the tricks of the enemy, and giving us the power over the enemy. Thank you, Lord, for restoring us, cleansing us, and filling us with the power of your Holy Spirit. Amen.\"\n\nFeel free to reach out if you need more prayers or support. We're here for you!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-06-10T23:12:23.970Z",
      "msg": "Amen"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-06-10T23:12:28.498Z",
      "msg": "Amen! If you need further support or have any other prayer requests, feel free to let me know. We're here to walk with you on this journey towards healing and freedom in Christ."
    }
  ],
  "domain": "fightlust.com"
}