{
  "id": "ab3cdc50-3718-11ef-ae4d-bb3fb44cfa94",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1719776456281621",
    "id": "628ed4ee7b967b11799146e8-vZVm3ZTPmN1WGgyD2zkxF",
    "email": null
  },
  "location": {
    "countryCode": "GB",
    "city": "Doncaster"
  },
  "messageCount": 4,
  "chatDuration": 124,
  "rating": 0,
  "createdOn": "2024-06-30T19:41:27.539Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2024-06-30T19:41:27.539Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-06-30T19:41:37.830Z",
      "msg": "Hi, my mind"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-06-30T19:41:42.733Z",
      "msg": "Hi there! It sounds like you might be feeling overwhelmed. How can I support you today? Would you like to talk about what's on your mind or need some guidance and prayer?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2024-06-30T19:43:25.366Z",
      "msg": "Guidance and prayer from the demon of negative thoughts holding me back from recovering from Mind altering g prescribed medication, my life force has been sucked fom me and I can't experience joy o life as I know it and God intended"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2024-06-30T19:43:31.473Z",
      "msg": "I'm so sorry to hear that you're going through this. Let's start with a prayer for strength and deliverance:\n\n\"Father, we come boldly before Your throne of grace, seeking Your help and strength. Fill us with the power of Your Holy Spirit. We submit ourselves and our lives unto You, for Your Word says that if we submit ourselves unto You, we can resist the enemy, and he will flee from us. Lord, we are fully submitted to You, all that we are and all that we ever hope to be. We surrender unto You, Father, for we are weak, but You are strong. In our weaknesses, we are made strong because Your Word says that our strength is not in our will, but in faith. Our strength and hope are in You. Therefore, Lord, we confess our strength in You and the power of Your might right now. In the name of Jesus, we cast out all negative thoughts and strongholds that the enemy has tried to bring against us. We thank You, Lord, for delivering us and restoring our joy and life as You intended. Amen.\"\n\nIf you need more specific prayers or resources, please let me know. We're here to support you in your journey towards healing."
    }
  ],
  "domain": "www.fightlust.com"
}