{
  "id": "3455c960-ee26-11ef-ad32-6f49cf35f76f",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1739903332472983",
    "id": "628ed4ee7b967b11799146e8-Qxp0Wl00LrRwiEmOSNg34",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Auburndale"
  },
  "messageCount": 6,
  "chatDuration": 393,
  "rating": 0,
  "createdOn": "2025-02-18T18:29:24.672Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-02-18T18:29:24.672Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-18T18:32:11.856Z",
      "msg": "Hi how are you first off,"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-18T18:32:14.546Z",
      "msg": "I'm here to help you! How can we support you in your journey towards healing today?"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-18T18:34:43.014Z",
      "msg": "I need prayer I'm struggling with lust due to masturbation and spirit of lust and pornography"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-18T18:34:53.025Z",
      "msg": "Thank you for sharing that with me. We are here to pray with you and for you. Here's a prayer you can use:\n\n\"Heavenly Father, we come before your throne room today through the blood of Jesus Christ. We pray against the Spirit of lust and all sexual sins, including masturbation and pornography. We renounce these things in the name of Jesus Christ and ask for your strength and healing. Fill us with the power of your Holy Spirit and help us walk in sexual purity. Thank you for your forgiveness and grace. In Jesus' name, Amen.\"\n\nIf you have any specific requests or need further support, feel free to share!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-02-18T18:35:53.304Z",
      "msg": "I accept Jesus as my Lord and Savior"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-02-18T18:35:57.822Z",
      "msg": "That's wonderful to hear! Accepting Jesus as your Lord and Savior is a significant step in your journey. If you need guidance on how to grow in your faith or any resources to help you along the way, just let me know! We're here to support you."
    }
  ],
  "domain": "fightlust.com"
}