{
  "id": "04601fb0-3699-11f0-bcc8-9310b47f447a",
  "type": "chat",
  "pageId": "628ed4ee7b967b11799146e8",
  "visitor": {
    "name": "V1747869127938270",
    "id": "628ed4ee7b967b11799146e8-DDUDBUbwmkoM1ADkJ7i4u",
    "email": null
  },
  "location": {
    "countryCode": "US",
    "city": "Unknown"
  },
  "messageCount": 6,
  "chatDuration": 472,
  "rating": 0,
  "createdOn": "2025-05-21T23:12:39.260Z",
  "messages": [
    {
      "sender": {
        "t": "s"
      },
      "type": "msg",
      "time": "2025-05-21T23:12:39.260Z",
      "msg": "Welcome to our site! If you are looking for prayer or someone to chat with, reply to this message or email us at prayer@fightlust.com"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-05-21T23:18:07.951Z",
      "msg": "I’m in need of prayer against sexual bondage and lust of the body and mind"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-05-21T23:18:17.986Z",
      "msg": "We're here to support you in your journey. Here's a prayer you can use to help combat sexual bondage and lust:\n\n---\n\nHeavenly Father,  \nWe come before your throne room today through the blood of Jesus Christ. We come boldly and with confidence. We are praying against the Spirit of lust within our hearts, minds, and bodies. We renounce all sexual sins that we have been involved in the past, including fornication, masturbation, pornography, and perversion, in the name of Jesus Christ. We break all curses of lust and command all spirits of lust and perversion to come out now. We present our bodies to You as a living sacrifice and ask for Your strength to walk in sexual purity. Fill us with the power of Your Holy Spirit and help us to overcome the temptations we face. We thank You for Your healing and deliverance. In Jesus' name, Amen.\n\n---\n\nIf you have any specific requests or need further support, feel free to share!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-05-21T23:19:46.850Z",
      "msg": "Yes I need more help"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-05-21T23:19:54.478Z",
      "msg": "Absolutely! We’re here to help you. Would you like guidance on specific resources, prayers, or perhaps someone to talk to about what you're experiencing? Let me know how I can assist you further!"
    },
    {
      "sender": {
        "t": "v"
      },
      "type": "msg",
      "time": "2025-05-21T23:20:20.312Z",
      "msg": "Someone to talk to"
    },
    {
      "sender": {
        "t": "a",
        "n": "Jeremy"
      },
      "type": "msg",
      "time": "2025-05-21T23:20:30.852Z",
      "msg": "We understand that sometimes you need to talk to a real person for prayer, guidance, or encouragement. We are here to support you. Please hold as we connect you with a ministry team member who can assist you in your journey. If you’re unable to reach someone, feel free to email us at prayer@fightlust.com."
    }
  ],
  "domain": "fightlust.com"
}